#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/1742079998/2664
    # Отладка регулярных выражений
    #
    # Регулярные выражения Python – мощный и полезный инструмент,
    # но отлаживать их – то еще удовольствие. Оказывается, любую
    # регулярку можно визуализировать в виде дерева
    # синтаксического анализа. Эта возможность языка пока
    # экспериментальная, за нее отвечает флаг re.DEBUG в методе
    # re.compile.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
