#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/python_ready/904
    #
    # Дата: 2025-06-12 06:12:04+00:00
    #
    # Title: Python Ready | Программирование
    #
    # 👩‍💻 **Регулярки в Python: 8 практических полезных примеров
    # использования регулярных выражений!**
    # `
    # Собрал для вас примеры различных полезных применений
    # регулярных выражений в Python: от извлечения конкретных
    # данных до очистки текста и поиска определенных шаблонов.`

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
