#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    import re

    def validate_email(email):
        # Регулярное выражение для проверки формата электронной почты
        pattern = r'^[\w\.-]+@[a-zA-Z\d\.-]+\.[a-zA-Z]{2,}$'

        # Проверяем соответствие формату
        if re.match(pattern, email):
            return True
        else:
            return False

    # Пример использования
    email = input("Введите адрес электронной почты: ")
    if validate_email(email):
        print("Введенный адрес электронной почты действителен.")
    else:
        print("Введенный адрес электронной почты недействителен.")

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
