#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/pro100python1/2932
    #
    # Дата: 2025-06-19 17:07:31+00:00
    #
    # Title: Просто Python | Data science | ML | AI
    #
    # 🔥 **Регулярные выражения в Python от простого к сложному.
    # Подробности, примеры, картинки, упражнения**
    #
    # Регулярное выражение — это строка, задающая шаблон поиска
    # подстрок в тексте.
    #
    # Одному шаблону может соответствовать много разных строчек.
    #
    # - Данный материал это достаточно **многобуквенный материал с
    # подробностями, тонкостями, картинками и задачами**.
    #
    # **➡️**** **[**habr.com**](https://habr.com/ru/articles/349860/)**

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
