#------------------------------------------
# Metaclasses_02_ ():
#------------------------------------------
def Metaclasses_02_ ():
    """Metaclasses_02_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Metaclasses_02_.__name__)
    print ('#-----------------------------')

    # https://t.me/pytstart/96
    # ⚙️ Как работает metaclass в Python и зачем он нужен?
    #
    # В Python классы – это тоже объекты, которые создаются с
    # помощью метаклассов.
    #
    # Метакласс – это "фабрика классов", которая управляет их
    # созданием.
    #
    # 🟢 Обычный класс:
    #
    # class MyClass:
    #     pass
    #
    # 🟢 Что происходит на самом деле?
    #
    # MyClass = type("MyClass", (), {})
    # type() создаёт класс программно!
    #
    # ➡️ Создадим кастомный метакласс:
    #
    #
    # class Meta(type):
    #     def __new__(cls, name, bases, dct):
    #         print(f"Создаётся класс {name}")
    #         return super().__new__(cls, name, bases, dct)
    #
    # class MyClass(metaclass=Meta):
    #     pass
    #
    # 🗣️ При создании MyClass вызовется Meta.__new__()
    #
    # 📌 Где это используется?
    #
    #  • В ORM (например, Django)
    #  • В создании API и автоматической генерации кода
    #  • В динамическом изменении классов

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Metaclasses_02_ ()
#endif

#endmodule
