#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/681
    # ❓Что такое Протоколы
    #
    # Протоколы — это соглашения, которые определяют интерфейс
    # класса и поведение его объектов.
    #
    # Протоколы задаются с помощью специальных методов, таких как
    # str, len и другие.
    # Они позволяют классам работать с различными функциями и
    # операторами языка.
    #
    # Реализуя протоколы можно интегрировать классы в языке и
    # делать их поведение естественным и интуитивным.
    #
    # 🐍В Python есть протоколы для чисел, итераторов, контекстных
    # менеджеров, атрибутов и других областей.
    # Встроенные и сторонние библиотеки полагаются на стандартные
    # протоколы.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
