#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/1940980684/709
    # 🐍 Основы метаклассов: простое понимание и примеры
    #
    # Python славится своей гибкостью и способностью
    # приспосабливаться к различным задачам программирования.
    # Одним из ключевых элементов его синтаксиса является
    # объектно-ориентированное программирование (ООП), позволяющее
    # структурировать код, делая его более модульным и легко
    # поддерживаемым.
    #
    # В этой статье автор постарался максимально просто объяснить,
    # что такое метаклассы и где они используются.
    #
    # Ссылка на статью — КЛИК (https://habr.com/ru/articles/806545/)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
