#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/python_Ninjas/464
    #
    # Дата: 2025-06-02 15:03:00+00:00
    #
    # Title: Python Ninja | Программирование
    #
    # **Метаклассы Python
    #
    # **☝️ [Ссылка источник](https://habr.com/ru/articles/912842)**
    #
    #
    # Link: https://t.me/c/2208774687/796
    #
    # Дата: 2025-05-28 07:20:12+00:00
    #
    # Title: Easy Python | Программирование
    #
    # 🖱 **Осваиваем метаклассы в Python**
    #
    # Автор [этой статьи](https://habr.com/ru/articles/912842/) показал, как работают **метаклассы в Python**: что конкретно они делают, где их можно использовать и почему чаще всего лучше этого не делать.
    #
    # Чтиво скорее нацелено на начинающих **авторов библиотек**
    # или просто **любопытных читателей**, которые просто хотят
    # узнать что-то новое о Python.
    #
    # ⛓ **Ссылка: **[**Клик!**](https://habr.com/ru/articles/912842/)**
    #
    # Link: https://t.me/c/1676257985/3382
    #
    # Дата: 2025-06-06 10:03:00+00:00
    #
    # Title: Простой Python | Программирование
    #
    # **Метаклассы**
    #
    # Метаклассы в Python — это классы для классов. Если обычные
    # классы создают объекты, то метаклассы создают классы. В
    # данной статье автор рассказывает, для чего метаклассы
    # полезны, а где лучше не пользоваться ими.
    #
    # 👉[Читать статью](https://habr.com/ru/articles/912842/)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
