#------------------------------------------
# if_03_ ():
#------------------------------------------
def if_03_ ():
    """if_03_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', if_03_.__name__)
    print ('#-----------------------------')

    # https://t.me/pyth0n_er/513
    # 🖥Тернарный оператор
    #
    # Тернарный оператор — это оператор, позволяющий записать
    # условную конструкцию if-else в одну строку.
    #
    # Тернарный оператор часто используется для условного
    # присваивания значений переменной, выбора между двумя
    # вариантами в одну строку.
    # Он позволяет сократить и упростить запись условных
    # выражений. Однако не рекомендуется использовать вложенные
    # конструкции, т. к. это ухудшает читаемость.
    #
    # В данном примере тернарный оператор используется:
    # — Для вывода одной из двух фраз в зависимости от условия a >
    # b.
    # — Для присваивания переменной result одного из двух значений
    # в зависимости от четности a.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    if_03_ ()
#endif

#endmodule
