#------------------------------------------
# if_02_ ():
#------------------------------------------
def if_02_ ():
    """if_02_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', if_02_.__name__)
    print ('#-----------------------------')

    # https://t.me/pyth0n_er/931
    # ➡️Что такое тернарный оператор?
    #
    # Тернарный оператор, также известный как условный оператор,
    # является уникальным оператором, который используется для
    # выполнения конденсированных версий простых операторов if-
    # else. Он принимает три аргумента: условие, значение, если
    # условие истинно, и значение, если условие ложно.
    #
    # ➡️Применение тернарного оператора
    #
    # Тернарный оператор используется, когда мы хотим сократить
    # код и упростить чтение. Это особенно полезно в случаях,
    # когда нам нужно сделать простое условное присваивание.
    # Однако из-за его сжатого формата, использование тернарного
    # оператора в сложных условиях может затруднить понимание
    # кода.
    #
    # ➡️Тернарный оператор в Python
    #
    # Да, Python поддерживает тернарный оператор. В Python
    # тернарный оператор выглядит следующим образом: x if
    # condition else y. Здесь x присваивается, если условие
    # истинно, иначе присваивается y.
    #
    # ➡️Пример использования тернарного оператора в Python:
    #
    # age = 15
    # type = "teenager" if age < 18 else "adult"
    # print(type)  # Выведет: teenager
    #
    #
    # ⬆️В этом примере, если переменная age меньше 18, переменной
    # type присваивается значение "teenager", в противном случае -
    # "adult".


#endfunction


#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    if_02_ ()
#endif

#endmodule
