#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/python_tg/1875
    # 🐍 Конструкция assert
    #
    # assert — это удобный инструмент для отладки и тестирования,
    # который проверяет, что определенное условие выполняется.
    # Если условие ложно, assert вызывает AssertionError и может
    # вывести сообщение с описанием ошибки.
    #
    # 📌 Используйте assert для проверки предположений на этапе
    # разработки, но помните, что он может быть отключен в релизе,
    # поэтому не подходит для продакшен-кода.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
