#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

Link: https://t.me/Python_per_month/3474

Дата: 2025-07-03 13:42:13+00:00

Title: Python Learning

**Класс Template

**__Класс Template позволяет создавать шаблоны текста с
подстановкой переменных.__

Это удобно для генерации текста на основе шаблона.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
