#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_libr/2602
    # �
    # � Модуль unicodedata в Python, база данных Unicode.
    #
    # • Модуль unicodedata обеспечивает доступ к базе данных символов Unicode (UCD), которая определяет свойства символов для всех символов Unicode.
    #
    # • Модуль unicodedata использует те же имена и символы, которые определены в Стандартном приложении Unicode № 44 "База данных символов Unicode" .
    #
    # 📕 Документация
    #
    #  (https://docs-python.ru/standart-library/modul-unicodedata-python/)#урок

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
