#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonPortal/4375
    # Используйте тип Literal в сигнатурах Python-функций для
    # аргументов, представляющих варианты
    #
    # Это лучше,  (https://t.me/PythonPortal)чем использовать общий тип, к которому  (https://t.me/PythonPortal)относятся эти значения
    #
    # Более строгое указание типов помогает раньше ловить ошибки.
    #
    # Кроме того, это документирует допустимые значения

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
