#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3404
    # ⚙️ sqlite3 для специалистов по данным и инженеров
    #
    # ℹ️ К радости специалистов по данным и инженеров, Python
    # поставляется со встроенной поддержкой баз данных и SQL через
    # библиотеку sqlite3.
    #
    # Просто подключитесь к любой базе данных (или создайте её) с
    # помощью объекта подключения и запускайте SQL-запросы.
    #
    # 🔗 Ссылочка на доку (https://docs.python.org/3/library/sqlite3.html)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
