#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')
h
    # ttps://t.me/Python_libr/2114
    # 📌 SQLite
    #
    # Реляционная база данных внутри файла. У неё только базовые
    # возможности, но она подойдёт для маленьких систем и для
    # тестирования.
    #
    # Для работы с ней есть встроенная библиотека — sqlite3. Также SQLite можно использовать и вместе с ORM, такими как SQLAlchemy (https://t.me/Python_libr/729).
    #
    # 📕 Документация
    #
    #  (https://docs.python.org/3/library/sqlite3.html)#урок

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
