#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_libr/1784
    # 📌 Избавляемся от отступов в многострочных строках
    #
    # Если вы уже использовали тройные кавычки в своём проекте, то
    # знаете, что у них серьёзные проблемы с отступами. То, что мы
    # делаем для красоты, остаётся в проекте.
    #
    # Мы можем пойти двумя путями: полностью убрать отступы, что
    # сделает код некрасивым, или использовать textwrap.dedent().
    #
    # 📕 Документация
    #
    #  (https://docs.python.org/3/library/textwrap.html)#урок

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
