#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_libr/2081
    # 📌 Форматирование параграфа, модуль textwrap
    #
    # • Функция textwrap.fill() принимает текст в качестве входных
    # данных и возвращает отформатированный текст.
    #
    # • Текст выравнивается по левому краю, первая строка
    # сохраняет свой отступ, а пробелы в начале каждой последующей
    # строки вставляются в абзац.
    #
    # 📕 Документация
    #
    #  (https://docs-python.ru/standart-library/modul-textwrap-python/#:~:text=%D0%A4%D0%BE%D1%80%D0%BC%D0%B0%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%20%D0%BF%D0%B0%D1%80%D0%B0%D0%B3%D1%80%D0%B0%D1%84%D0%B0.)#урок
    #
    # import textwrap as tw
    #
    # print(tw.fill(text, width=50) )


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
