#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/315
    # 🔐Запрос пароля у пользователя
    #
    # Множеству инструментов командной строки или скриптов для
    # работы требуется имя пользователя и пароль. Если вам
    # придётся писать подобную программу – вы, возможно, сочтёте
    # полезным модуль getpass.
    #
    # Этот очень простой пакет позволяет запрашивать у
    # пользователя его пароль, а также получать имя пользователя,
    # извлекая имя, под которым он вошёл в систему.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
