#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/696
    # 🐍Модуль doctest
    #
    # Модуль doctest — это легкий фреймворк для тестирования,
    # который позволяет автоматизировать тестирование кода,
    # используя его документацию. Модуль ищет в документации
    # примеры кода, которые можно выполнить, и проверяет,
    # соответствуют ли результаты ожидаемым.
    #
    # Как использовать doctest?
    #
    # Чтобы использовать doctest, необходимо импортировать его в
    # свой код:
    #
    # import doctest
    #
    # Затем, в документации вашей функции или класса, вы можете
    # добавить примеры кода, которые хотите протестировать.
    # Примеры должны начинаться с ключевого слова >>> и
    # заканчиваться ожидаемым результатом.
    #
    # Чтобы запустить тесты doctest, вы можете использовать
    # функцию doctest.testmod(). Если тесты пройдут успешно,
    # ничего не будет напечатано. Если тесты потерпят неудачу,
    # будет напечатано сообщение об ошибке, указывающее на причину
    # неудачи.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
