#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/python_practics/2443
    # Создание множества из списка
    #
    # Этот сниппет преобразует список в множество, удаляя
    # дубликаты. Множества автоматически игнорируют повторяющиеся
    # элементы.
    #
    # def list_to_set(lst):
    # return set(lst)
    #
    # # Tpumep ucnonb30BaHna
    # data = [1, 2, 2, 3, 4, 4]
    # print(list_to_set(data)) # {1, 2, 3, 4}

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
