#------------------------------------------
# except_01_ ():
#------------------------------------------
def except_01_ ():
    """except_01_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', except_01_.__name__)
    print ('#-----------------------------')

    # https://t.me/python_ready/651
    # 👩‍💻 Вспомним исключения в Python и их причины!
    #
    # Исключения — важный инструмент для написания надежного и
    # устойчивого к ошибкам кода. В Python много встроенных
    # исключений, предусматривающих все возможные ошибки, их мы в
    # этом посте и разберем!

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    except_01_ ()
#endif

#endmodule
