#------------------------------------------
# Emulating_numeric_xor_01_ ():
#------------------------------------------
def Emulating_numeric_xor_01_ ():
    """Emulating_numeric_xor_01_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Emulating_numeric_xor_01_.__name__)
    print ('#-----------------------------')


    # ​ (http://api.channely.co/file/b1dec865e7b2476b8efc2756bf4d
    # 68fb)Оператор xor
    #
    # В Python оператор xor (исключающее ИЛИ) обозначается как ^.
    # Он применяется к двум булевым операндам и возвращает True,
    # если только один из них имеет значение True, а остальные —
    # False. Если оба операнда имеют одинаковые значения (True или
    # False), то результатом будет False.
    #
    # Пример использования оператора xor в Python:
    #
    # a = True
    # b = False
    #
    # result = a ^ b
    # print(result) # Выводит: True
    #
    # В этом примере переменная a имеет значение True, а
    # переменная b имеет значение False. Оператор xor применяется
    # к этим операндам, и результатом будет True.
    #
    # Если оба операнда имеют одинаковые значения, например, оба
    # True или оба False, результат будет False:
    #
    # c = True
    # d = True
    #
    # result = c ^ d
    # print(result) # Выводит: False
    #
    # В этом примере оба операнда (c и d) имеют значение True,
    # поэтому результатом будет False.
    #
    # Таким образом, оператор xor возвращает True, только если
    # только один из операндов имеет значение True, а остальные
    # операнды имеют значение False.


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Emulating_numeric_xor_01_ ()
#endif

#endmodule
