#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/seniorpy/3308
    #
    # Дата: 2025-06-17 18:37:17+00:00
    #
    # Title: Senior Python Developer
    #
    # **Заменяем часть строки
    #
    # **Со строками в Python работать очень удобно, так как
    # встроенных методов для них довольно много. Одним из методов
    # является `str.replace()`, который позволяет заменять части
    # строк.
    #
    # Первым аргументом передается подстрока, которая будет
    # изменяться в исходной строке. Вторым аргументом — то, на что
    # будет заменяться.
    #
    # Также есть третий опциональный аргумент, который отвечает за
    # то, сколько раз вы хотите заменить старую подстроку на
    # новую. По умолчанию все вхождения заменяются.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
