"""Strings_.py"""
# -*- coding: UTF-8 -*-
__annotations__ = """
 =======================================================
 Copyright (c) 2022-2025
 Author:
     Lisitsin Y.R.
 Project:
     LIBRARY_PY
 Module:
     Strings_.py
 =======================================================
"""

#------------------------------------------
# БИБЛИОТЕКИ python
#------------------------------------------

#------------------------------------------
# БИБЛИОТЕКИ сторонние
#------------------------------------------

#------------------------------------------
# Strings_test ():
#------------------------------------------
def Strings_ ():
    """Strings_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Strings_.__name__)
    print ('#-----------------------------')

    # https://t.me/seniorpy/3112
    # Форматируемые шаблоны строк
    #
    # Модуль string из стандартной библиотеки содержит интересный
    # класс Template, который позволяет вполне удобно создавать
    # шаблоны строк для дальнейшего форматирования.
    #
    # Такой способ появился ещё в Python 2.4, как замена
    # %-форматированию, но популярным так и не стал. Поддерживает
    # передачу значений по имени и использует $-синтаксис как в
    # PHP.

#endfunction

#------------------------------------------
# main ():
#------------------------------------------
def main ():
    """main"""
#beginfunction
    Strings_ ()
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    main()
#endif

#endmodule
