#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/Python_per_month/3449
    #
    # Дата: 2025-06-17 18:46:08+00:00
    #
    # Title: Python Learning
    #
    # ⚙️** glob для удобной работы с файлами**
    #
    # ℹ️ Для пользователей, которым нравится сопоставление
    # шаблонов в стиле Unix, библиотека glob должна чувствовать
    # себя как дома.
    #
    # 🗣️ **glob содержит все необходимые функции для работы с
    # несколькими файлами одновременно без головной боли.**
    #
    # 🔗 [**Ссылочка на доку**](https://docs.python.org/3/library/glob.html)**
    #
    # https://t.me/Python_per_month/2765
    # ⚙️ glob для удобной работы с файлами
    #
    # ℹ️ Для пользователей, которым нравится сопоставление
    # шаблонов в стиле Unix, библиотека glob должна чувствовать
    # себя как дома.
    #
    # 🗣️ glob содержит все необходимые функции для работы с
    # несколькими файлами одновременно без головной боли.
    #
    # 🔗 Ссылочка на доку (https://docs.python.org/3/library/glob.html)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
