#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')
h
    # ttps://t.me/seniorpy/3240
    # Находим файлы по шаблону
    #
    # Основной фишкой модуля glob является удобная и лаконичная
    # работа с поиском файлов по паттернам. Более того, можно даже
    # пройтись по директориям рекурсивно.
    #
    # В одноименный метод glob передаётся шаблон для поиска
    # файлов, а возвращается список с результатами. Все методы
    # следуют механизму и правилам сопоставления паттернов в стиле
    # Unix.
    #
    # Вообще модуль является встроенным, но в некоторых ситуациях
    # импорт может выдать исключение. В таком случае надо просто
    # его переустановить через пакетный менеджер pip.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
