#------------------------------------------
# class_basic_02_ ():
#------------------------------------------
def class_basic_02_ ():
    """class_basic_02_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', class_basic_02_.__name__)
    print ('#-----------------------------')

    # 🤔 Методы eq, ne, lt, le, qt, qe?
    #
    # Также относятся к "магическим методам" и используются для перегрузки операторов сравнения. Эти методы позволяют вам определить, как объекты вашего класса будут сравниваться друг с другом с использованием операторов равенства, неравенства, меньше, меньше или равно, больше и больше или равно.
    #
    # 🟠Метод `eq`
    # Отвечает за оператор равенства ==. Он позволяет определить, когда два объекта вашего класса считаются равными.
    # class Person:
    #     def __init__(self, name, age):
    #         self.name = name
    #         self.age = age
    #
    #     def __eq__(self, other):
    #         return self.name == other.name and self.age == other.age
    #
    # p1 = Person("Alice", 30)
    # p2 = Person("Alice", 30)
    # p3 = Person("Bob", 25)
    #
    # print(p1 == p2)  # Вывод: True
    # print(p1 == p3)  # Вывод: False
    #
    # 🟠Метод `ne`
    # Отвечает за оператор неравенства !=. Он позволяет определить, когда два объекта вашего класса считаются неравными.
    # class Person:
    #     def __init__(self, name, age):
    #         self.name = name
    #         self.age = age
    #
    #     def __ne__ (self, other):
    #         return self.name != other.name or self.age != other.age
    #
    # p1 = Person("Alice", 30)
    # p2 = Person("Alice", 30)
    # p3 = Person("Bob", 25)
    #
    # print(p1 != p2)  # Вывод: False
    # print(p1 != p3)  # Вывод: True
    #
    # 🟠Метод `lt`
    # Отвечает за оператор меньше <. Он позволяет определить, когда один объект вашего класса считается меньше другого.
    # class Person:
    #     def __init__(self, name, age):
    #         self.name = name
    #         self.age = age
    #
    #     def __lt__(self, other):
    #         return self.age < other.age
    #
    # p1 = Person("Alice", 30)
    # p2 = Person("Bob", 25)
    #
    # print(p1 < p2)  # Вывод: False
    # print(p2 < p1)  # Вывод: True
    #
    # 🟠Метод `le`
    # Отвечает за оператор меньше или равно <=. Он позволяет определить, когда один объект вашего класса считается меньше или равен другому.
    # class Person:
    #     def __init__(self, name, age):
    #         self.name = name
    #         self.age = age
    #
    #     def __le__(self, other):
    #         return self.age <= other.age
    #
    # p1 = Person("Alice", 30)
    # p2 = Person("Bob", 30)
    # p3 = Person("Charlie", 25)
    #
    # print(p1 <= p2)  # Вывод: True
    # print(p1 <= p3)  # Вывод: False
    #
    # 🟠Метод `gt`
    # Отвечает за оператор больше >. Он позволяет определить, когда один объект вашего класса считается больше другого.
    # class Person:
    #     def __init__(self, name, age):
    #         self.name = name
    #         self.age = age
    #
    #     def __gt__(self, other):
    #         return self.age > other.age
    #
    # p1 = Person("Alice", 30)
    # p2 = Person("Bob", 25)
    #
    # print(p1 > p2)  # Вывод: True
    # print(p2 > p1)  # Вывод: False
    #
    # 🟠Метод `ge`
    # Отвечает за оператор больше или равно >=. Он позволяет определить, когда один объект вашего класса считается больше или равен другому.
    # class Person:
    #     def __init__(self, name, age):
    #         self.name = name
    #         self.age = age
    #
    #     def __ge__(self, other):
    #         return self.age >= other.age
    #
    # p1 = Person("Alice", 30)
    # p2 = Person("Bob", 30)
    # p3 = Person("Charlie", 25)
    #
    # print(p1 >= p2)  # Вывод: True
    # print(p1 >= p3)  # Вывод: True
    # print(p3 >= p1)  # Вывод: False

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    class_basic_02_ ()
#endif

#endmodule
