"""class_basic_.py"""
# -*- coding: UTF-8 -*-
__annotations__ = """
 =======================================================
 Copyright (c) 2022-2025
 Author:
     Lisitsin Y.R.
 Project:
     LIBRARY_PY
 Module:
     class_basic_.py
 =======================================================
"""

#------------------------------------------
# БИБЛИОТЕКИ python
#------------------------------------------

#------------------------------------------
# БИБЛИОТЕКИ сторонние
#------------------------------------------

#------------------------------------------
# class_basic_ ():
#------------------------------------------
def class_basic_ ():
    """class_basic_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', class_basic_.__name__)
    print ('#-----------------------------')

    # https://t.me/pyth0n_er/465
    # ⌨️object
    #
    # object - это встроенный класс, от него наследуются сразу все
    # новые классы, если явно не указан другой базовый класс. У
    # объектов класса object есть методы init, str, repr и другие.
    # Их можно переопределять в дочерних классах. Атрибуты класса
    # объявляются внутри класса, но вне всех методов. Атрибуты
    # экземпляра объявляются в init. Чтобы использовать класс
    # object в своем коде, достаточно создать класс,
    # унаследованный от object.

#endfunction

#------------------------------------------
# main ():
#------------------------------------------
def main ():
    """main"""
#beginfunction
    class_basic_ ()
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    main()
#endif

#endmodule
