#------------------------------------------
# yield_02_ ():
#------------------------------------------
def yield_02_ ():
    """yield_02_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', yield_02_.__name__)
    print ('#-----------------------------')


    # https://t.me/python_tg/1966
    # 🐍 Ключевое слово yield from: делегирование генераторов
    #
    # yield from — это способ делегировать часть работы другому
    # генератору или итерируемому объекту. Вместо того, чтобы
    # вручную перебирать значения вложенного генератора, можно
    # просто передать управление с помощью yield from.
    #
    # 📌 yield from упрощает работу с вложенными генераторами,
    # передавая управление и результаты их итераций без лишнего
    # кода.
    #
    # def generator1():
    #
    # yield from range(3)
    #
    # yield “Done” # BoiBegeT:
    # # 0
    # def generator2(): # 1
    # yield from generator1() # 2
    # yield "Complete" # Done
    #
    # # Complete
    #
    # for item in generator2():
    #
    # print(item)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    yield_02_ ()
#endif

#endmodule
