#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/PythonTechCode/1982
    #
    # Дата: 2025-06-03 03:07:06+00:00
    #
    # Title: Python Tech Code • IT
    #
    # 📶 **Сканирование портов
    # **
    # Библиотека **socket** входит в стандартную библиотеку Python
    # и предоставляет удобный способ работы с сетевыми
    # соединениями.
    #
    # ⬆️С её помощью можно создавать клиентские и серверные
    # приложения, а также сканировать порты для проверки их
    # статуса.
    #
    # Сканирование портов может быть использовано для:
    #
    # 🟡Диагностики сетевых проблем.
    # Определяет, открыты ли необходимые порты для работы
    # приложений.
    # 🟡Оценки безопасности.
    # Определяет, какие порты открыты на ваших серверах, и
    # проверьте их на предмет уязвимостей.
    # 🟡Управления сервером.
    # Позволяет отслеживать статус серверов и их доступность.
    #
    # 👉 __При запуске данного скрипта получим статус портов на
    # указанном хосте.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
