#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/1676257985/2479
    # fileno()
    #
    # Метод fileno() возвращает файловый дескриптор для данного
    # файла. Файловый дескриптор — это целочисленное значение,
    # которое однозначно определяет открытый файл в операционной
    # системе. Он используется для операций ввода/вывода с файлом.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
