#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')
    # https://t.me/Python_per_month/2544
    # fspathconf
    #
    # fspathconf() – это функция в Python, которая используется
    # для получения конфигурационных параметров для указанного
    # пути. Эта функция является частью модуля os и может
    # использоваться для получения информации о файловой системе,
    # такой как размер блока, максимальная длина пути и т. д.
    #
    # Синтаксис:
    # os.fspathconf(path, name)
    #
    # Аргументы:
    # path: путь к файлу или папке
    # name: имя конфигурационного параметра

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
