#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/1742079998/2628
    # Как получить текущий рабочий каталог с помощью Python?
    #
    # Работая с Python, вам может понадобиться читать и записывать
    # файлы из различных каталогов. Чтобы узнать, в каком вы
    # сейчас работаете, можно использовать метод getcwd() из
    # модуля os:
    #
    # import os
    # os.getcwd()
    #
    # https://t.me/c/1940980684/484
    # 🐍 Узнаем текущую директорию
    #
    # getcwd() — метод из модуля os module, с помощью которого
    # можно узнать, в какой директории мы сейчас находимся.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
