#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/2485
    # Функция abspath()
    #
    # Функция abspath() возвращает абсолютный путь к указанному
    # пути. Абсолютный путь — это путь, который начинается с
    # корневого каталога файловой системы.
    #
    # Функция abspath() принимает в качестве аргумента путь к
    # файлу или каталогу. Путь может быть относительным или
    # абсолютным.
    #
    # Если путь является относительным, то функция abspath()
    # преобразует его в абсолютный, относительно текущего рабочего
    # каталога.
    #
    # Если путь является абсолютным, то функция abspath()
    # возвращает его без изменений.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
