#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')
    # https://t.me/seniorpy/2877
    # Метод file.writelines()
    #
    # Метод файла file.writelines() записывает последовательность
    # (список) строк в файл file.
    #
    # Последовательностью может быть любой итерируемый объект,
    # содержащий в качестве элементов строки. Обычно это список
    # строк.
    #
    # Обратите внимание, что метод file.writelines() не добавляет
    # разделители строк автоматически. Если они требуются, то
    # добавляйте их вручную.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
