#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/python_tg/1812
    # 🐍 Поиск файлов в директории с помощью os.walk()
    #
    # Для поиска файлов в директории и её поддиректориях Python
    # предлагает удобный инструмент — функцию os.walk() из модуля
    # os. Она рекурсивно обходит все папки, начиная с указанной,
    # возвращая список поддиректорий и файлов.
    #
    # С её помощью можно легко искать файлы с определённым
    # расширением, например, .txt, во всех вложенных папках. Это
    # универсальное решение для задач, связанных с обработкой
    # файловой системы.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
