#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/2546
    # Функция scandir()
    #
    # Функция os.scandir() в Python используется для получения
    # итератора объектов os.DirEntry, соответствующих записям в
    # каталоге, заданном указанным путем. Записи возвращаются в
    # произвольном порядке, а специальные записи '.' и '..' всегда
    # будут в начале списка.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
