#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonTechCode/231
    # Получаем информацию о сети
    #
    # Для получения информации о заданной сети и маске подсети IP-
    # адреса, вы можете использовать объект типа IPv4Network в
    # библиотеке ipaddress в Python.
    #
    # Этот код позволяет создать объект IPv4Network, а затем
    # вывести в консоль следующую информацию:
    #
    # 1. IP-адрес сети.
    # 2. Маску подсети.
    # 3. Обратную маску подсети.
    #
    # Эта информация может быть полезна при работе с IP-адресами и
    # подсетями, так как она предоставляет данные о сетевых
    # параметрах.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
