#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/1940980684/414
    # 🐍 Queue
    #
    # Queue (очередь) — это структура данных, в которую элементы
    # могут быть добавлены вызовом put() и извлечены вызовом
    # метода get().
    #
    # Модуль queue реализует очереди с несколькими производителями
    # (multi-producer) и потребителями (multi-consumer)
    #
    # Документация — КЛИК (https://docs.python.org/3/library/queue.html)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
