#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/403
    # Класс Process
    #
    # Process — это класс для создания и управления отдельными
    # процессами из модуля multiprocessing.
    # Создание процесса выполняется конструктором Process,
    # передавая целевую функцию и аргументы.
    #
    # При создании процессов нужно учитывать:
    # — Ограничения на доступ к данным между процессами.
    # — Синхронизацию процессов при необходимости.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
