#------------------------------------------
# match_02_ ():
#------------------------------------------
def match_02_ ():
    """match_02_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', match_02_.__name__)
    print ('#-----------------------------')

    # Link: https://t.me/pro100python1/2905
    #
    # Дата: 2025-05-29 15:30:27+00:00
    #
    # Title: Просто Python | Data science | ML | AI
    #
    # 🗺 **Инструкция match-case — аналог switch-case в Python
    #
    # **Эта статья познакомит вас с инструкцией match-case,
    # которая была представлена в Python 3.10.
    #
    # - Мы рассмотрим ее **синтаксис, применение в науке о данных
    # и машинном обучении** и даже **сравним ее с традиционными
    # инструкциями switch-case** в других языках.
    #
    # ➡️ [**pythonist**](https://pythonist.ru/instrukcziya-match-case-analog-switch-case-v-python/)[

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    match_02_ ()
#endif

#endmodule
