#------------------------------------------
# with_02_ ():
#------------------------------------------
def with_02_ ():
    """with_02_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', with_02_.__name__)
    print ('#-----------------------------')

    # https://t.me/pyth0n_er/562
    # 🖥 Context Managers, a must-use  Python feature
    #
    # Most know them for file handling, but they shine in other
    # areas too, like managing database connections.
    #
    # Контекстные менеджеры, обязательные для использования 🐍
    # функции Python.
    #
    # Вот почему они полезны:
    #
    # - Управление ресурсами: С их поимщью вы можете
    # Автоматизировать настройку и удаление ресурсов для более
    # чистого, защищенного от утечек кода.
    #
    # - Обработка ошибок: Элегантно управляйте исключениями,
    # обеспечивая экономию ресурсов.
    #
    # - Ясность кода: с помощью менеджеров задается четкая область
    # использования ресурсов, что повышает читабельность.
    #
    # Большинство использует контекстные менеджер для работе с
    # файлами, но они отлично работают и в других случаях,
    # например, при управлении соединениями с базами данных.
    #
    #
    # import sqlite3
    #
    # class DatabaseConnection:
    # def _init (self, db file):
    # self.db file = db file
    # self.connection = None
    #
    # def _enter_ (self):
    # self.connection = sqlite3.connect(self.db file)
    # return self.connection
    #
    # def _exit__(self, exc_type, exc_val, exc_tb):
    # if self.connection:
    # self.connection.close()
    #
    # with DatabaseConnection('my database.db') as conn:
    # cursor = conn.cursor()
    #
    # cursor.execute("SELECT * FROM my table")
    # results = cursor.fetchall()
    #
    # print(results)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    with_02_ ()
#endif

#endmodule
