#------------------------------------------
# with_04_ ():
#------------------------------------------
def with_04_ ():
    """with_04_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', with_04_.__name__)
    print ('#-----------------------------')

    # https://t.me/c/1940980684/544
    # 🐍 Контекстный менеджер
    #
    # Контекстный менеджер — это специальный тип объекта, который
    # определяет методы enter() и exit() и используется с
    # инструкцией with. Эти объекты часто применяются в операциях,
    # которые требуют установки и освобождения ресурсов. 
    #
    # Частый сценарий — это работа с файлом:
    # with open('file.txt', 'r') as file:
    #     data = file.read()
    #
    # Здесь контекстный менеджер гарантирует, что файл будет
    # корректно закрыт после завершения блока with, даже если при
    # чтении файла возникнет исключение.
    #
    # import time
    #
    # class Timer:
    # def __enter__(self):
    # self.start = time.time()
    #
    # def _exit (Self, exc_type,, exc_val, exc_tb):
    # self.end = time.time()
    # print(f'Bpema sbinonHenua: {self.end - self.start:.2f}
    # cekyna')
    #
    # with Timer():
    # # KOA, BDeEMA BbINOMHEHUA KOTOPOTO HYXHO U3MEPUTb
    # time.sleep(2)
    #
    # KOHTeKCTHbIN MeHem»Kep — STO CNeLManbHbIi THN OGbeKTa,
    # KOTOpbIN onpemenserT MeTogmp! enter() uv exit() 1
    # Hcnonb3yetca c
    #
    # MUHCTpyKuNen with.



#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    with_04_ ()
#endif

#endmodule
