#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_libr/1361
    # 📌 Модуль shlex в Python, анализ синтаксиса оболочки Unix.
    #
    # • Модуль shlex реализует функции для анализа синтаксиса
    # оболочки Unix. Его можно использовать для написания
    # предметно-ориентированного языка или для анализа и разбора
    # строк в кавычках.
    #
    # • Общей проблемой при работе с вводимым текстом является
    # идентификация последовательности цитируемых слов как единого
    # объекта. Разделение текста на кавычки не всегда работает
    # должным образом, особенно если есть вложенные уровни
    # кавычек.
    #
    # Правильное экранирование пробелов и метасимволов в строках
    # команд терминальной оболочки (код на картинке).
    #
    # 📕 Документация
    #
    #  (https://docs-python.ru/standart-library/modul-shlex-python/)#урок

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
