#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/python_tg/2556
    # 🐍 unittest — стандартный модуль тестирования в Python
    #
    # unittest — это встроенный инструмент для написания и запуска
    # модульных тестов. Он помогает убедиться, что изменения в
    # коде не ломают существующую логику.
    #
    # Что умеет unittest:
    # ▶️ Поддерживает структуру xUnit, знакомую по другим языкам
    # (например, JUnit в Java)
    #
    # ▶️ Позволяет создавать независимые тесты для функций и
    # классов
    #
    # ▶️ Даёт доступ к множеству assert-методов (assertEqual,
    # assertTrue, assertRaises и др.)
    #
    # ▶️ Группирует тесты в классы, а также позволяет создавать
    # наборы и запускать их вместе
    #
    # ▶️ Работает “из коробки” — ничего устанавливать не нужно
    #
    # ▶️ Поддерживает запуск тестов из командной строки и CI/CD-
    # сред
    #
    # ▶️ Помогает найти ошибки до того, как они попадут в прод
    #
    # Библиотека подходит для проектов любого масштаба и позволяет
    # системно контролировать поведение кода при его развитии.
    #
    # 📖 Документация (https://docs.python.org/3/library/unittest.html)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
