#------------------------------------------
# Class_05_ ():
#------------------------------------------
def Class_05_ ():
    """Class_05_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Class_05_.__name__)
    print ('#-----------------------------')

    # https://t.me/python_easy_ru/1178
    # 🤔 Два способа создания класса
    #
    # В Python можно создать класс двумя основными способами:
    # Через class (обычный способ)
    # Через type() (динамическое создание класса)
    #
    # 🚩Обычное создание класса через `class`
    #
    # Это стандартный способ, который мы используем чаще всего.
    # class Person:
    #     def __init__(self, name):
    #         self.name = name
    #
    #     def say_hello(self):
    #         return f"Привет, я {self.name}!"
    #
    # p = Person("Алиса")
    # print(p.say_hello())  # Привет, я Алиса!
    #
    # 🚩Динамическое создание класса через `type()`
    #
    # Функция type() позволяет создать класс "на лету".
    # Person = type("Person", (object,), {
    #     "__init__": lambda self, name: setattr(self, "name",
    # name),
    #     "say_hello": lambda self: f"Привет, я {self.name}!"
    # })
    #
    # p = Person("Боб")
    # print(p.say_hello())  # Привет, я Боб!

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Class_05_ ()
#endif

#endmodule
