#------------------------------------------
# Class_04_ ():
#------------------------------------------
def Class_04_ ():
    """Class_04_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Class_04_.__name__)
    print ('#-----------------------------')

    # Link: https://t.me/PythonPortal/4470
    #
    # Дата: 2025-06-10 06:07:01+00:00
    #
    # Title: Python Portal
    #
    # **Анатомия Python-класса
    # **
    # Почти всё, что может содержать определение класса в Python —
    # в одной картинке.
    #
    # Удобный визуал, чтобы быстро освежить синтаксис и структуру


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Class_04_ ()
#endif

#endmodule
