#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/python_easy_ru/1488
    #
    # Дата: 2025-06-25 09:05:06+00:00
    #
    # Title: Python | Вопросы собесов
    #
    # **🤔**** Два способа создания класса**
    #
    # В Python можно создать класс двумя основными способами:
    # Через `class` (обычный способ)
    # Через `type()` (динамическое создание класса)
    #
    # 🚩**Обычное создание класса через `class`**
    #
    # Это стандартный способ, который мы используем чаще всего.
    # ```class Person:
    #     def __init__(self, name):
    #         self.name = name
    #
    #     def say_hello(self):
    #         return f"Привет, я {self.name}!"
    #
    # p = Person("Алиса")
    # print(p.say_hello())  # Привет, я Алиса!```
    #
    # 🚩**Динамическое создание класса через `type()`**
    #
    # Функция `type()` позволяет создать класс "на лету".
    # ```Person = type("Person", (object,), {
    #     "__init__": lambda self, name: setattr(self, "name",
    # name),
    #     "say_hello": lambda self: f"Привет, я {self.name}!"
    # })
    #
    # p = Person("Боб")
    # print(p.say_hello())  # Привет, я Боб!```

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
