#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_libr/1994
    # 📌 copy
    #
    # Библиотека для создания поверхностных и глубоких копий
    # объекта.
    #
    # Неглубокая копия — копия объекта, который сохраняет ссылки
    # на существующие объекты, а не создаёт новые.
    #
    # Глубокая копия создает рекурсивно копирует объекты, на
    # которые ссылается полученный экземпляр.
    # import copy
    #
    # original_list = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
    #
    # shallow_copy = copy.copy(original_list)
    # shallow_copy[o][] = 1¢
    # print(original_list)
    #
    # print(shallow_copy)
    #
    # deep_copy = copy.deepcopy(original_list)
    #
    # deep_copy[0][0] = 1
    #
    # print(original_list)
    # print(deep_copy)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
