#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/codeblog8/253
    # Проверка изменений в модулей с помощью importlib
    #
    # Более того, если это динамическая программа (https://t.me/codeblog8/252), она подразумевает тот факт, что модули могут быть изменены в ходе выполнения программы.
    #
    # Importlib предоставляет функционал, который поддерживает
    # перезагрузку модулей "на лету" с учетом всех изменений.
    #
    # 80 🔥 и идем дальше

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
