#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/814
    # 🐍Для динамического импорта модулей в Python можно
    # использовать функцию import_module() из стандартной
    # библиотеки importlib.
    #
    # ⬆️В данном примере код динамически импортирует модуль random
    # и использует функцию sample() из этого модуля для выбора
    # нескольких случайных элементов из списка.
    #
    # ➡️Обычно динамический импорт модулей применяется, когда
    # имена модулей неизвестны на этапе написания кода, а
    # определяются в процессе выполнения программы.
    # Например, на основе пользовательского ввода или
    # конфигурационных данных.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
