#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/2758
    # ⚙️ Contextlib для обработки внешних источников
    #
    # ℹ️ Библиотека contextlib в Python предоставляет утилиты для
    # работы с контекстными менеджерами и упрощения создания и
    # использования ресурсов с помощью оператора with.
    #
    # 🔗 Ссылочка на доку (https://docs.python.org/3/library/contextlib.html)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
