#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/python_tg/1420
    # 🐍 Модуль contextlib
    #
    # Модуль contextlib помогает легко создавать контекстные
    # менеджеры без необходимости писать методы __enter__ и
    # __exit__, что упрощает работу с ресурсами, такими как файлы
    # или сетевые подключения.
    #
    # 📌 Используйте contextlib, когда нужно кратковременно
    # управлять ресурсами, без создания сложных классов или
    # конструкций.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
