#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3072
    # ⚙️ contextlib.redirect_stdout
    #
    # Функция contextlib.redirect_stdout в Python временно
    # перенаправляет вывод print() и других операций записи.
    # Полезно, когда нужно записать вывод в файл или перехватить
    # его для дальнейшей обработки.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
