#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/seniorpy/2739
    # ➡️ Использование contextlib.contextmanager для создания
    # контекстных менеджеров
    #
    # Иногда бывает нужно создать собственный контекстный менеджер
    # для управления ресурсами, такими как файлы или сетевые
    # соединения.
    #
    # ✔️ В Python для этого можно использовать декоратор
    # contextlib.contextmanager, что делает код простым и
    # элегантным.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
