#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/1742079998/2637
    # Добавляем дополнительные атрибуты к элементам enum в Python
    #
    # Техника, о которой пойдёт речь в этой статье может
    # пригодиться в различных ситуациях. Например, когда элемент
    # должен хранить разный формат данных для одной задачи —
    # скажем, HEX, RGB и текстовое описание цвета.
    #
    # О том, как это сделать, вы можете узнать в этой статье:
    #
    # Читать
    #
    #  (https://rednafi.github.io/reflections/add-additional-attributes-to-enum-members-in-python.html)#статья | Python_Teacher (https://t.me/+gRA5JByBIeA0Mjgy)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
