#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonTechCode/212
    # Разбор URL-адреса
    #
    # Работа с URL-адресами значительно упрощается благодаря
    # использованию модуля urllib.parse.
    #
    # Важный инструмент этого модуля - функция urlparse(), которая
    # позволяет эффективно разбирать URL-адрес на составляющие
    # элементы, такие как тип соединения, основной адрес, путь к
    # ресурсу и параметры запроса.
    #
    # Процесс использования функции urlparse() включает передачу
    # URL-адреса в качестве входных данных и получение удобного
    # объекта, который содержит разделенные компоненты URL-адреса.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
