#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # ​ (http://api.channely.co/file/3e382b4080684b52833ad4f4d0af
    # 2993)Эффективный способ указывать путь к файлам
    #
    # С помощью библиотеки pathlib вы можете сократить длину кода,
    # задав переменную «домашний путь» (home):
    #
    # from pathlib import Path
    #
    # home = Path.home()
    # file = home / "treasure_map.txt"
    # file.touch()
    # print(f"Ваш файл злесь: {file}")

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
