#------------------------------------------
# Descriptors_2760 ():
#------------------------------------------
def Descriptors_2760 ():
    """Descriptors_2760"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Descriptors_2760.__name__)
    print ('#-----------------------------')

    # https://t.me/seniorpy/2760
    # ⚙️ Ленивая инициализация свойств с помощью дескрипторов
    #
    # ➡️ Дескрипторы в Python позволяют управлять доступом к
    # атрибутам объекта.
    #
    # 🗣️ С их помощью можно реализовать ленивую инициализацию
    # свойств, что особенно полезно для дорогостоящих операций,
    # которые нужно выполнять только при первом обращении к
    # свойству
    class LazyProperty:
        def __init__ (self, func):
            self.func = func
            self.name = func.__name__

        def __get__(self, obj, cls):
            if obj is None:
                return self
            value = self.func (obj)
            setattr (obj, self.name, value)
            return value

    # Пример использования
    class DataLoader:
        def __init__ (self, data_source):
            self.data_source = data_source
        @LazyProperty
        def data (self):
            print ("Загрузка данных...")
            # Имитация долгой загрузки данных
            return [x for x in range (1, 1001)]

    # Пример использования
    loader = DataLoader ("some_source")
    print ("До обращения к свойству data")
    print (loader.data)  # Выводит: Загрузка данных... [1, 2, 3, ..., 1000]
    print ("После обращения к свойству data")
    print (loader.data)  # Выводит: [1, 2, 3, ..., 1000] без повторной загрузки




#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Descriptors_2760 ()
#endif

#endmodule
