#------------------------------------------
# Descriptors_2898 ():
#------------------------------------------
def Descriptors_2898 ():
    """Descriptors_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Descriptors_2898.__name__)
    print ('#-----------------------------')

    # https://t.me/seniorpy/2760
    # ⚙️ Ленивая инициализация свойств с помощью дескрипторов
    #
    # ➡️ Дескрипторы в Python позволяют управлять доступом к
    # атрибутам объекта.
    #
    # 🗣️ С их помощью можно реализовать ленивую инициализацию
    # свойств, что особенно полезно для дорогостоящих операций,
    # которые нужно выполнять только при первом обращении к
    # свойству
    class LazyProperty:
        def __init__ (self, func):
            self.func = func
            self.name = func.__name__

        def __get__(self, obj, cls):
            if obj is None:
                return self
            value = self.func (obj)
            setattr (obj, self.name, value)
            return value

    # Пример использования
    class DataLoader:
        def __init__ (self, data_source):
            self.data_source = data_source
        @LazyProperty
        def data (self):
            print ("Загрузка данных...")
            # Имитация долгой загрузки данных
            return [x for x in range (1, 1001)]

    # Пример использования
    loader = DataLoader ("some_source")
    print ("До обращения к свойству data")
    print (loader.data)  # Выводит: Загрузка данных... [1, 2, 3, ..., 1000]
    print ("После обращения к свойству data")
    print (loader.data)  # Выводит: [1, 2, 3, ..., 1000] без повторной загрузки




    # https://t.me/Python_per_month/2898
    # ➡️ Использование дескрипторов для управления доступом к
    # атрибутам
    #
    # Дескрипторы — это мощный, но часто недооцененный механизм в
    # Python, который позволяет управлять доступом к атрибутам
    # объектов. С помощью дескрипторов можно реализовать логику
    # при чтении, записи или удалении атрибутов класса.
    #
    # • Дескриптор — это объект, который управляет доступом к
    # другому объекту. Для этого используются методы __get__,
    # __set__ и __delete__.
    #
    # • В примере выше дескриптор PositiveNumber контролирует
    # запись значения в атрибут. Если значение отрицательное,
    # выбрасывается ошибка. Это позволяет реализовать проверку
    # значений на уровне атрибутов.
    #
    # • Дескрипторы позволяют инкапсулировать логику доступа в
    # отдельный класс, который можно переиспользовать в нескольких
    # местах, улучшая структурированность и читаемость кода.
    class PositiveNumber:
        def __init__ (self, initial_value=0):
            self.value = initial_value
        def __get__ (self, instance, owner):
            return self.value
        def __set__ (self, instance, value):
            if value < 0:
                raise ValueError ("Value must be positive")
            self.value = value

    class MyClass:
        number = PositiveNumber ()

    obj = MyClass ()
    obj.number = 10
    print (obj.number)  # Вывод: 10
    obj.number = -5     # Вывод Valuefrror: Value must be positive






#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Descriptors_2898 ()
#endif

#endmodule
