#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/zen_of_python/2586
    # ​ (http://api.channely.co/file/3fd62d7fb26644bb94ac534e38daa
    # 240)asyncio для сетевых инженеров
    #
    # Исчерпывающий гайд, с помощью которого вы узнаете, в чём
    # разница между параллельными процессами, потоками и
    # асинхронным программированием.
    #
    # Руководство под авторством Натальи Самойленко (https://asyncpyneng.readthedocs.io/ru/latest/index.html) разделено на несколько частей:
    #
    # — основы работы с сопрограммами;
    # — асинхронные модули;
    # — создание классов в asyncio;
    # — использование модуля asyncio;
    # — работа с циклом событий.
    #
    # Документация также дополняется блоком заданий и примеров
    # кода.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
