#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')
https://t.me/PythonTechCode/265
Работа с файловым указателем

Метод tell() используется для получения текущего положения
файлового указателя относительно начала файла.

Возвращаемое значение — целое число, представляющее
количество байтов, которое было считано или записано с
момента открытия файла.

При чтении файла данный метод указывает позицию, с которой
будут выполнены следующие операции чтения, а при записи -
позицию, с которой будет произведена следующая операция
записи.


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
