#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/python_ready/941
    #
    # Дата: 2025-06-20 10:12:08+00:00
    #
    # Title: Python Ready | Программирование
    #
    # 👩‍💻 **Разбираемся с dataclasses в питончике!**
    #
    # `Шпаргалка по ключевым декораторам и функциям модуля
    # dataclasses, который упрощает создание классов с данными.
    # Удобный способ автоматически генерировать методы,
    # преобразовывать объекты в словари или кортежи, а также
    # делать экземпляры неизменяемыми.`

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
