#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/seniorpy/2757
    # ⚙️ Использование dataclasses для создания неизменяемых
    # объектов
    #
    # В Python 3.7 и выше можно использовать модуль dataclasses
    # для создания простых классов данных.
    #
    # 🗣️ Одной из интересных возможностей является создание
    # неизменяемых (immutable) объектов, которые не могут быть
    # изменены после создания.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
