#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_libr/2094
    # Работа с файлами Python в оперативной памяти. IO Python -
    # Собираем файлы в ОЗУ
    #
    # • В данном видео мы рассмотрим модуль io, который позволяет
    # использовать буфер для работы с файлами в озу. Мы покажем 2
    # примера, в которых будем использовать сначала работу с
    # файлами используя для этого файловую систему с сохранением
    # на диск, после чего на этом же примере мы покажем то, как
    # можно производить те же действия используя только ОЗУ и
    # никак не взаимодействуя при этом с жестким диском.
    #
    # • Такой подход обеспечивает более высокую скорость
    # выполнения и у вас нет необходимости сохранять что либо на
    # диске, так как все действия можно произвести в оперативной
    # памяти, к примеру обработать файл, передать его на сервер, в
    # бота телеграмм и т.д.
    #
    # 🧷 https://youtu.be/ZFyM0JgLqjg

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
