#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/2408
    # Функция tell()
    #
    # Функция tell() используется для получения текущей позиции
    # указателя в потоке данных. Она применяется чаще всего при
    # работе с файлами, но также может использоваться с другими
    # типами потоков, например, сокетами или консольным вводом.
    #
    # Возвращаемое значение: целое число, указывающее положение
    # указателя в байтах от начала потока.
    # Аргументы: tell() не принимает никаких аргументов.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
