#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/python_piton_javascript/2819
    # tell()
    #
    # Метод tell в Python используется для определения текущей
    # позиции указателя файла. Он возвращает целое число,
    # представляющее количество байт от начала файла до текущей
    # позиции.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
