"""Bytes_"""
# -*- coding: UTF-8 -*-
__annotations__ = """
 =======================================================
 Copyright (c) 2022-2025
 Author:
     Lisitsin Y.R.
 Project:
     LIBRARY_PY
 Module:
     Bytes_.py
 =======================================================
"""

#------------------------------------------
# БИБЛИОТЕКИ python
#------------------------------------------

#------------------------------------------
# БИБЛИОТЕКИ сторонние
#------------------------------------------

#------------------------------------------
# Bytes_ ():
#------------------------------------------
def Bytes_ ():
    """Bytes_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Bytes_.__name__)
    print ('#-----------------------------')

    # bytes.hex() — это метод, который преобразует объект bytes в
    # шестнадцатеричную строку.
    #
    # Как работает: bytes.hex() возвращает строку, состоящую из
    # шестнадцатеричных цифр, представляющих каждый байт в объекте
    # bytes. Шестнадцатеричные цифры идут парами, где первая цифра
    # представляет старший полубайт, а вторая - младший полубайт.
    #
    # Например, байт со значением 10 (в десятичной системе) будет
    # представлен как "0a" в шестнадцатеричной системе.
    b = b'Hello, world!'
    hex_string = b.hex()
    print(hex_string)

#endfunction

#------------------------------------------
# main ():
#------------------------------------------
def main ():
    """main"""
#beginfunction
    Bytes_ ()
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    main()
#endif

#endmodule
