#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3227
    # ⚙️ inspect.getmembers()
    #
    # Метод inspect.getmembers() из модуля inspect позволяет
    # получить список всех членов объекта, включая методы,
    # атрибуты и встроенные свойства. Это полезно для анализа
    # структуры классов и объектов во время выполнения.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
