#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pytstart/83
    # 👩‍💻 inspect – разбираем Python-код на лету
    #
    # ❓ Как узнать, какие аргументы принимает функция?
    #
    # import inspect
    #
    # def example(a, b, c=10):
    #     pass
    #
    # print(inspect.signature(example))
    # # (a, b, c=10)
    #
    # ❓ Как узнать код функции?
    #
    # print(inspect.getsource(example))
    #
    # ❓ Как узнать, откуда вызвана функция?
    #
    # print(inspect.stack()[0])
    #
    # 🗣️ Полезно для анализа кода, профилирования и инструментов
    # отладки

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
