#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonTechCode/617
    # 📕 Как получать docstring объектов
    #
    # Функция inspect.getdoc() из стандартного модуля inspect
    # возвращает строку документации (docstring) для переданного
    # объекта.
    #
    # 🤔 Если объект не содержит строки документации, функция
    # вернёт None.
    #
    # Синтаксис:
    #
    # inspect.getdoc(object)
    #
    # где:
    # object - объект Python, для которого нужно получить строку
    # документации.
    #
    # ❗Функция inspect.getdoc() может быть полезна для
    # динамического анализа или отладки кода.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
