#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonTechCode/332
    # Взгляд внутрь ZIP-архива
    #
    # Класс ZipFile из модуля zipfile позволяет работать с
    # архивами ZIP.
    #
    # В данном примере используем метод printdir(), который
    # выводит содержимое архива на экран, включая имена всех
    # файлов и папок внутри архива.
    #
    # Затем вызываем метод extractall(), который распаковывает все
    # файлы из архива в текущую директорию, где находится скрипт
    # Python.
    #
    # Этот код полезен при необходимости просмотра содержимого
    # архива ZIP и извлечения всех файлов из него.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
