#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/seniorpy/2839
    # Операции с zip архивами
    #
    # Для манипуляций с zip файлами используется встроенный модуль zipfile (установка не требуется). Напомним, что zip (https://ru.wikipedia.org/wiki/ZIP) используется для сжатия файлов без потерь.
    #
    # Посмотреть файлы архива можно с printdir, извлечь все файлы — с extractfile. У модуля есть еще несколько полезных функций, включая создание собственных архивов. Документация: https://docs.python.org/3/library/zipfile.html

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
