#------------------------------------------
# try_00_ ():
#------------------------------------------
def try_00_ ():
    """try_00_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', try_00_.__name__)
    print ('#-----------------------------')

    # https://t.me/py_1000_prog/3908
    # ▶️ Обработка исключений Try Except Finally Python
    #
    # Обработка исключений в Python – это процесс написания кода
    # для перехвата и обработки ошибок или исключений, которые
    # могут возникать при выполнении программы
    #
    # Для обработки исключений в Python используется следующий
    # синтаксис:
    # try:
    #     <код, который может вызвать исключения при выполнении>
    # except <КлассИсключения_1>:
    #     <код обработки исключения>
    # except <КлассИсключения_2>:
    #     <код обработки исключения>
    # ...
    # else:
    #     <код выполняется, если не вызвано исключение в блоке
    # try>
    # finally:
    #     <код, который выполняется всегда>

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    try_00_ ()
#endif

#endmodule
