#------------------------------------------
# continue_01_ ():
#------------------------------------------
def continue_01_ ():
    """continue_01_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', continue_01_.__name__)
    print ('#-----------------------------')

    # https://t.me/seniorpy/3114
    # Оператор continue
    #
    # Оператор continue в Python используется для перевода
    # управления программой в начало цикла. Он пропускает
    # оставшиеся строки кода внутри цикла и запускает следующую
    # итерацию.
    #
    # В основном он используется для определенного условия внутри
    # цикла, чтобы мы могли пропустить конкретный код для
    # определенного условия.
    #
    # Обратите внимание на вывод приведенного выше кода, значение
    # 2 пропущено, потому что мы предоставили условие if с помощью
    # оператора continue в цикле for. Когда он соответствует
    # заданному условию, тогда управление передается в начало
    # цикла for, и оно пропускает значение 2 из кода.
    #
    # i=0
    # for i in range(4):
    # T= Ud
    # uf (1 = 2):
    # continue
    #
    # print(i)


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    continue_01_ ()
#endif

#endmodule
