#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_libr/1736
    # 📌 functools.singledispatch()
    #
    # Декоратор позволяет определить функцию, которая может быть
    # перегружена на основе типа ее первого аргумента.
    #
    # Используется для создания функций, которые ведут себя по-
    # разному в зависимости от типа их ввода.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
