#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/2761
    # ⚙️ functools для более мощных функций
    #
    # ℹ️ Библиотека содержит множество методов и декораторов,
    # которые вы можете обернуть существующими, чтобы добавить
    # дополнительные функции.
    #
    # 🗣️ Одним из них является partial, который можно использовать
    # для клонирования функций, сохраняя при этом некоторые из их
    # аргументов с пользовательскими значениями
    #
    # 🔗 Ссылочка на доку (https://docs.python.org/3/library/functools.html)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
