#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/400
    # Используем встроенные функции в Python для написания
    # стандартной логики
    # (ч.2)
    #
    # Как показано в примере выше, с помощью функции map() мы
    # можем избежать написания цикла for для выделения заглавными
    # буквами каждого слова в списке имен.
    #
    # Другая известная функция - reduce(). Как следует из ее
    # названия, она применяет функцию к итератору и выполняет для
    # нее операцию reduce.
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
