#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/2383487131/187
    # 📱 Фишка: Использование functools.partial для настройки
    # функций
    #
    # functools.partial позволяет создавать функции с
    # предопределёнными аргументами, что полезно для сокращения
    # кода и повышения читаемости.
    #
    # ⚙️ Пример использования
    #
    # from functools import partial
    #
    # def greet(greeting, name):
    #     return f"{greeting}, {name}!"
    #
    # # Создаём функцию с предопределённым приветствием
    # say_hello = partial(greet, "Hello")
    # print(say_hello("Alice"))
    # # Вывод: Hello, Alice!
    #
    # ➡️  Пример функции преобразования типов:
    #
    # int_base_2 = partial(int, base=2)
    # print(int_base_2("1010"))
    # # Вывод: 10
    #
    #  Используйте partial для настройки функций и упрощения
    # повторяющихся вызовов!

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
