#------------------------------------------
# in_02_ ():
#------------------------------------------
def in_02_ ():
    """in_02_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', in_02_.__name__)
    print ('#-----------------------------')

    # https://t.me/python_practics/1381
    # Проверка наличия подстрок в строке списка
    #
    # В отличие от других языков программирования, в Python
    # имеется для этого хорошее ключевое слово.
    #
    # https://t.me/pyth0n_er/362
    # Проверка наличия подстрок в строке списка
    #
    # А вот и задача, с которой многим приходится иметь дело
    # ежедневно: проверять, есть ли в строке подстрока. В отличие
    # от других языков программирования, в Python имеется для
    # этого хорошее ключевое слово.
    #
    #
    # https://t.me/c/1940980684/419
    # 🐍 Проверяем содержит ли строка подстроку
    #
    # Чтобы проверить, содержит ли строка подстроку, вы можете
    # просто использовать if x in my_string синтаксис.
    #
    # Если вам также нужно знать позицию подстроки, вы можете
    # использовать string.find()
    #
    #
    #
    # addresses = [
    # "12/45 Elm street",
    # "34/56 Clark street’,
    # ‘56,77 maple street’,
    # ‘17/45 Elm street'
    #
    # ]
    #
    # street = 'Elm street'
    #
    # for i in addresses:
    # if street in i:
    #
    # print(i)
    #
    # *** output
    #
    # 12/45 Elm street
    #
    # 17/45 Elm street
    #
    #
    # ee
    #
    # addresses = [
    # "12/45 Elm street",
    # "34/56 Clark street',
    # "56,77 maple street',
    # "17/45 Elm street'
    #
    # ]
    # street = 'Elm street'
    # for i in addresses:
    # if street in i:
    # print(i)
    #
    # "* output
    # 12/45 Elm street
    # 17/45 Elm street
    #
    #
    # MpoBepsem cofep)KuT nu
    # CcTpoKa nogcTpoKy
    #
    # my_string = "Hello World"
    # if "World" in my_string:
    # print("has substring")
    # UTo6bI NpoBepnTb, Copep>KUT 1M CTpoKa NOACTpOKy,
    #
    # BbI MO>KeTe MpocTo UcnoNb30Batb If x in my_string
    # CUHTakcnc
    #
    #
    #
    #
    # https://t.me/c/2383487131/216
    # 🔍 Фишка: Быстрая проверка подстроки с помощью оператора in
    #
    # Вместо использования громоздких методов поиска, таких как
    # .find(), Python позволяет лаконично проверить наличие
    # подстроки с помощью оператора in.
    #
    # ⚙️ Пример:
    #
    # text = "Python — отличный язык!"
    # if "отличный" in text:
    #     print("Нашли слово!")  # Вывод: Нашли слово!
    #
    # Оператор in работает не только со строками, но и с другими
    # коллекциями (списки, множества, словари).
    #
    # 🔜 Пример с коллекциями:
    #
    # items = [1, 2, 3]
    # print(2 in items)  # Вывод: True



#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    in_02_ ()
#endif

#endmodule
