#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/seniorpy/2883
    # ➡️ Использование модуля ast для анализа и модификации
    # исходного кода Python
    #
    # Модуль ast (Abstract Syntax Tree) позволяет анализировать и
    # модифицировать исходный код Python на уровне его
    # абстрактного синтаксического дерева (AST). Это мощный
    # инструмент для тех, кто хочет динамически изменять код,
    # строить анализаторы или трансформировать Python-программы на
    # лету.
    #
    # 🗣 Этот модуль предоставляет доступ к внутренним структурам
    # Python, что делает его полезным для статического анализа
    # кода или автоматического изменения исходного текста
    # программы.
    #
    # ✔️ ast открывает множество возможностей для тех, кто
    # занимается метапрограммированием или созданием собственных
    # инструментов для анализа и оптимизации Python-кода.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
