#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3175
    # ⚙️ ast.literal_eval()
    #
    # Метод ast.literal_eval() из модуля ast безопасно вычисляет
    # выражения Python из строки. Это полезно для обработки данных
    # из текстовых файлов или ввода, где требуется парсинг
    # структур данных, таких как списки, словари или числа.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
