#------------------------------------------
# type_01_ ():
#------------------------------------------
def type_01_ ():
    """type_01_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', type_01_.__name__)
    print ('#-----------------------------')

    # https://t.me/PythonPortal/4232
    # В Python 3.12+ можно использовать оператор type для создания
    # псевдонимов типов
    #
    # Эти псевдонимы могут быть также обобщёнными (generic)
    #
    # Это гораздо короче и удобнее, чем эквивалентный код до
    # Python 3.12 с использованием TypeAlias и TypeVar


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    type_01_ ()
#endif

#endmodule
