#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pylinux0/380
    # 🖼️ Python библиотека - shutil
    #
    # shutil - это стандартная библиотека Python, предназначенная
    # для облегчения многих задач по работе с файлами и
    # каталогами. Она предоставляет удобные функции для
    # копирования, перемещения, удаления файлов и директорий, а
    # также множество других операций с файловой системой.
    #
    # ✔️ Некоторые возможности:
    #
    # 🟢Копирование файлов и директорий
    # 🟢Перемещение и переименование файлов и директорий
    # 🟢Удаление файлов и директорий
    # 🟢Архивация и разархивация
    # 🟢Получение информации о дисковом пространстве
    #
    # Например, вот так можно копировать файлы и директории:
    #
    # import shutil
    #
    # # Копирование файла
    # shutil.copy("source.txt", "destination.txt")
    #
    # # Копирование директории со всем ее содержимым
    # shutil.copytree("source_directory", "destination_directory")
    #
    # Широкий набор функций делает библиотеку shutil полезной для
    # решения различных задач, связанных с файловой системой.
    #
    # 🔗 Документация shutil (https://docs.python.org/3/library/shutil.html)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
