#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

# https://t.me/Python_libr/1706
# 📌 shutil
#
# Встроенный модуль для высокоуровневой работы с файлами. С
# его помощью можно скопировать, переместить, удалить файл или
# папку.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
