#------------------------------------------
# Decorators_02_ ():
#------------------------------------------
def Decorators_02_ ():
    """Decorators_02_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Decorators_02_.__name__)
    print ('#-----------------------------')

    # Link: https://t.me/Python_per_month/3434
    #
    # Дата: 2025-06-01 19:00:17+00:00
    #
    # Title: Python Learning
    #
    # ⚙️** Декорируем функции**
    #
    # 🗣️ **Декоратор** – это обертка вокруг функции, которая
    # определенным образом изменяет ее поведение. Существуют
    # варианты использования декораторов, и вы, возможно, уже
    # применяли их раньше при работе с такими фреймворками, как
    # Flask.
    #
    # ```def print_argument(func):
    #     def wrapper(the_number):
    #         print("Argument for",
    #               func.__name__,
    #               "is", the_number)
    #         return func(the_number)
    #     return wrapper
    # @print_argument
    # def add_one(x):
    #     return x + 1
    # print(add_one(1))```
    #
    # Внутри `print_argument` мы определяем функцию-обертку. Она
    # выводит аргумент и имя вызываемой функции, выполняет
    # фактическую функцию и возвращает ее результат, как если бы
    # функция вызывалась «обычно».
    #
    # ➡️ С помощью `@print_argument` мы применяем наш декоратор к
    # функции. Декоратор может быть повторно использован и для
    # других функций.
    #
    # ```Argument for add_one is 1
    # 2```
    #
    # def print_argument( func):
    # def wrapper(the_number):
    # print("Argument for",
    # func.__name__,
    # "is", the_number)
    # return func(the_number)
    # return wrapper
    # @print_argument
    # def add_one(x):
    # return x + 1
    # print(add_one(1))
    #
    # Argument for add_one is 1

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Decorators_02_ ()
#endif

#endmodule
