#------------------------------------------
# Decorators_05_ ():
#------------------------------------------
def Decorators_05_ ():
    """Decorators_05_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Decorators_05_.__name__)
    print ('#-----------------------------')

    # Link: https://t.me/pro100python1/2925
    #
    # Дата: 2025-06-12 20:25:40+00:00
    #
    # Title: Просто Python | Data science | ML | AI
    #
    # 🤷‍♂ **Декораторы Python: пошаговое руководство
    #
    # ****Декораторы в Python** позволяют расширять и изменять
    # поведение вызываемых объектов (функций, методов и классов)
    # без постоянного изменения самого вызываемого объекта.
    #
    # Любая достаточно общая функциональность является отличным
    # примером использования декораторов.
    #
    # - Статья представляет собой** пошаговое руководство** о том,
    # как **декораторы могут помочь вам стать более эффективным и
    # продуктивным разработчиком на Python**.
    # **
    # ****➡️**** **[**habr.com**](https://habr.com/ru/companies/otus/articles/727590/)**
    

#endfunction


#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Decorators_05_ ()
#endif

#endmodule
