#------------------------------------------
# Decorators_06_ ():
#------------------------------------------
def Decorators_06_ ():
    """Decorators_06_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Decorators_06_.__name__)
    print ('#-----------------------------')

    # https://t.me/python_easy_ru/1210
    # 🤔 В чем отличие @foobar от @foobar()?
    #
    # В Python @ используется для декораторов, и разница между
    # @foobar и @foobar() заключается в том, вызывается ли сам
    # декоратор с параметрами или без.
    #
    # 🟠`@foobar` — декоратор без вызова
    # Если мы пишем @foobar, то используется сам декоратор как
    # есть, без передачи аргументов.
    # def foobar(func):
    #     def wrapper():
    #         print("Декоратор вызван!")
    #         return func()
    #     return wrapper
    #
    # @foobar  # Просто передаём функцию в декоратор
    # def hello():
    #     print("Hello, world!")
    #
    # hello()
    #
    # Вывод
    # Декоратор вызван!
    # Hello, world!
    #
    # 🟠`@foobar()` — декоратор с вызовом (и параметрами)
    # Если декоратор принимает параметры, то он сначала вызывается
    # (foobar()), а потом возвращает сам декоратор.
    # def foobar(arg):
    #     def decorator(func):
    #         def wrapper():
    #             print(f"Декоратор вызван с аргументом: {arg}")
    #             return func()
    #         return wrapper
    #     return decorator
    #
    # @foobar("Привет")  # Вызываем foobar("Привет"), который
    # вернёт реальный декоратор
    # def hello():
    #     print("Hello, world!")
    #
    # hello()
    #
    # Вывод
    # Декоратор вызван с аргументом: Привет
    # Hello, world!

#endfunction


#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Decorators_06_ ()
#endif

#endmodule
