#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/294
    # Создаем виртуальное окружение
    #
    # Виртуальное окружение — это изолированная среда, которая
    # имеет свои локальные интерпретатор и пакеты, независимые от
    # глобального интерпретатора и других окружений.
    #
    # В стандартной библиотеке Python третьей версии есть пакет
    # venv, который позволяет создавать виртуальные окружения
    # удобно и быстро. Пример представлен на картинке.
    #
    # Скрипт activate в директории bin предназначен для активации
    # окружения, а команда deactivate в уже активированном
    # окружении — для выхода из него.
    #
    # В случае успешного создания и активации у вас в терминале
    # должно появится название вашего виртуального окружения в
    # круглых скобках.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
