#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonTechCode/340
    # Экспертный подход к отладке
    #
    # Библиотека pdb (Python Debugger) предоставляет интерактивную
    # среду для отладки программ, которая позволяет выполнять код
    # пошагово, просматривать значения переменных и устанавливать
    # точки останова (breakpoints).
    #
    # Некоторые команды pdb:
    # • s (step into) - позволяет перейти к следующей логической
    # строке кода;
    # • n (next) - пропускает текущую строку и выполняет
    # следующую;
    # • q (quit) - завершает сессию отладки и продолжает
    # выполнение программы.
    #
    # Библиотека pdb позволяет разработчикам глубже понимать
    # логику выполнения программы, обнаруживать и исправлять
    # ошибки.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
