#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3352
    # ⚙️ dis.get_instructions()
    #
    # dis.get_instructions() возвращает пошаговую дизассемблировку
    # байткода функции. Это полезно для глубокого понимания работы
    # Python-интерпретатора, оптимизации и написания инструментов
    # анализа кода.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
