#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3239
    # ⚙️ dis.Bytecode()
    #
    # Метод dis.Bytecode() из модуля dis позволяет анализировать
    # байт-код Python-функций. Это полезно для оптимизации кода и
    # понимания его работы на уровне интерпретатора.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
