#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # ​ (http://api.channely.co/file/b39f703d07cb4e8fa7bea41c1d08
    # 4c60)Как скрыть предупреждения
    #
    # Вы можете использовать модуль warnings и установить
    # соответствующие параметры. Вот несколько способов скрыть
    # предупреждения в Python:
    #
    # import warnings
    #
    # warnings.filterwarnings("ignore",
    # category=DeprecationWarning)
    #
    # В этом примере предупреждения определенной категории, такой
    # как DeprecationWarning (предупреждение об устаревании),
    # будут игнорироваться.
    #
    # Этот код запрещает выводить предупреждения, но сохраняет их
    # во внутреннем буфере, который можно проверить позже, если
    # требуется.
    #
    # А вы «гасите» предупреждения? Поделитесь в комментариях.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
