#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonTechCode/211
    # Вывод предупреждений во время выполнения кода
    #
    # Модуль warnings в Python позволяет эффективно управлять
    # сообщениями о предупреждениях, которые могут появляться в
    # процессе выполнения программы.
    #
    # Предупреждения помогают выявлять потенциальные проблемы в
    # коде, но они не являются критическими ошибками.
    #
    # С помощью модуля warnings можно настроить обработку
    # предупреждений, определяя, какие из них нужно отображать,
    # какие игнорировать, и какие обрабатывать особым образом в
    # процессе работы программы.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
