#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # ​ (http://api.channely.co/file/e804f73aa17b47cb97cc8225394fcb92)
    #
    # Обработку исключений теперь можно сопроводить заметкой
    #
    # В свежем релизе Python 3.11.4 добавили add_note() в
    # стандартный класс исключений BaseException. Его можно
    # использовать для обогащения контекстной информацией.
    # Добавленные заметки появляются в трассировке по умолчанию.
    #
    # try:
    #     raise TypeError("unsupported operand")
    # except Exception as exc:
    #     exc.add_note("Пояснение...")
    #     raise
    #
    # Невероятно полезно при множестве блоков try-except.
    #
    # Подробнее о релизе здесь (https://docs.python.org/3/whatsnew/3.11.html#whatsnew311-pep678).


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
