#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pro_python_code/1614
    # Полный гайд по обработке ошибок в Python 🐍✍️
    #
    # Мигель Гринберг, известный автор мега-туториалов по Flask,
    # создал подробный гайд о том, как правильно обрабатывать
    # ошибки в Python. В нем рассматриваются следующие темы:
    #
    # - Два подхода к обработке ошибок: LBYL («Посмотри перед
    # прыжком») и EAFP («Проще попросить прощения, чем
    # разрешения»);
    # - Классификация ошибок;
    # - Способы обработки ошибок.
    #
    # Ссылки для чтения:
    # 🔗 Оригинал (https://blog.miguelgrinberg.com/post/the-ultimate-guide-to-error-handling-in-python)
    # 🔗 Перевод (https://habr.com/ru/articles/853056/)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
