"""Slices_slice01_list.py"""
# -*- coding: UTF-8 -*-
__annotations__ = """
 =======================================================
 Copyright (c) 2022-2025
 Author:
     Lisitsin Y.R.
 Project:
     LIBRARY_PY
 Module:
     Slices_slice01_list.py
 =======================================================
"""

#------------------------------------------
# БИБЛИОТЕКИ python
#------------------------------------------

#------------------------------------------
# БИБЛИОТЕКИ сторонние
#------------------------------------------

#------------------------------------------
# Slices_slice01_list ():
#------------------------------------------
def Slices_slice01_list ():
    """Slices_slice01_list"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Slices_slice01_list.__name__)
    print ('#-----------------------------')

    # 🔩 Срез списка Python
    #
    # Особенности работы со срезами:
    #
    # ▶️Срезы всегда возвращают новый список, а не изменяют
    # исходный.
    # ▶️Индексы могут выходить за границы списка без ошибок.
    # ▶️Если начало больше конца при положительном шаге - вернется
    # пустой список.
    # ▶️Срезы работают аналогично и для других последовательностей
    # (строки, кортежи).


#endfunction

#------------------------------------------
# main ():
#------------------------------------------
def main ():
    """main"""
#beginfunction
    Slices_slice01_list ()
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    main()
#endif

#endmodule
