"""Slices_slice01_.py"""
# -*- coding: UTF-8 -*-
__annotations__ = """
 =======================================================
 Copyright (c) 2022-2025
 Author:
     Lisitsin Y.R.
 Project:
     LIBRARY_PY
 Module:
     Slices_slice01_.py
 =======================================================
"""

#------------------------------------------
# БИБЛИОТЕКИ python
#------------------------------------------

#------------------------------------------
# БИБЛИОТЕКИ сторонние
#------------------------------------------

#------------------------------------------
# Slices_slice01_ ():
#------------------------------------------
def Slices_slice01_ ():
    """Slices_slice01_list"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Slices_slice01_.__name__)
    print ('#-----------------------------')

    # Срезы (slices) в Python — это способ получения подстроки (подсписка)
    # из последовательности, такой как строка (str), список (list) или кортеж (tuple).
    # Срезы в Python позволяют извлекать подмножества из последовательностей, таких как списки, строки и кортежи.
    #
    # Синтаксис срезов следующий: последовательность[start:stop:step], где:
    # ⚪️ start — начальный индекс (включительно),
    # ⚪️ stop — конечный индекс (исключительно),
    # ⚪️ step — шаг (по умолчанию 1).

    # list_name[start : stop: step]

    text = 'Python Developer'
    # V3Bne4b CumBonbl Cc uHgeKca O go 6 (He BKnwYaA 6)
    print(text[:6])         # BbiBeget: Python
    # V3sBne4b cumBonbl C uHgeKCa 7 AO KOHUAa
    print(text[7:])         # Bbiseget: Developer
    # WU3Bne4b KaxgbiA BTOPOKW CumBon c uHAeKca O gO KOHUAa
    print(text[::2])        # Bbipeget: Pto eoe

    my_list = [0, 1, 2, 3, 4, 5]
    # 1 и 2
    slice_1 = my_list[1:3]      # [1, 2]
    # все до 3
    slice_2 = my_list[:3]       # [0, 1, 2]
    # с 2 до конца
    slice_3 = my_list[2:]       # [2, 3, 4, 5]
    # каждый 2
    slice_4 = my_list[::2]      # [0, 2, 4]
    # в обратном порядке
    slice_5 = my_list[::-1]     # [5, 4, 3,2, 1, 0]

    # Нарезка списков в Python
    my_list = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
    # с 2 по 5
    print (my_list [2:6])
    # Output: [2, 3, 4, 5]
    # с начала до 3
    print (my_list [:4])
    # Output: [0, 1, 2, 3]
    # от 5 до конца
    print (my_list [5:])
    # Output: [5, 6, 7, 8, 9]

    # последние 3:
    print(my_list[-3:])
    # Output: [7, 8, 9]
    # от начала до предпоследнего:
    print(my_list[:-1])
    # Output: [0, 1, 2, 3, 4, 5, 6, 7, 8]

    # срез с шагом 2
    print(my_list[::2])
    # Output: [@, 2, 4, 6, 8]
    # срез с 1 по 7 с шагом 2
    print(my_list[1:8:2])
    # Output: [1, 3, 5, 7]

    # развернуть список
    print (my_list [::-1])
    # Output: (9, 8, 7, 6, 5, & 3 & 4, 8]
    # срез с 8 по 2 в обратном порядке с шагом -2
    print (my_list [8:1:-2])
    # Output: [8, 6, 4, 2]

    # Шаг среза
    # Третий аргумент slice-оператора в Python определяет шаг среза. По умолчанию он равен единице, поэтому в итоговый срез попадают все элементы диапазона подряд.
    a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    print(a[2:8:]) # [3, 4, 5, 6, 7, 8]
    # А можно взять, например, каждый второй элемент:
    print(a[2:8:2]) # [3, 5, 7]
    # Если передать третьим параметром -1, счет пойдет в обратном порядке. Так можно легко развернуть список или строку.
    print(a[::-1]) # [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]

#endfunction

#------------------------------------------
# main ():
#------------------------------------------
def main ():
    """main"""
#beginfunction
    Slices_slice01_ ()
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    main()
#endif

#endmodule
