#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3297
    # ⚙️ gc.freeze()
    #
    # gc.freeze() фиксирует все уже существующие объекты в памяти,
    # исключая их из будущих сборок мусора. Это полезно для
    # оптимизации долгоживущих процессов, например, серверов или
    # CLI-приложений, снижая нагрузку на сборщик мусора.
    #
    # 🔗 Документация (https://docs.python.org/3/library/gc.html#gc.freeze)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
