#------------------------------------------
# Tuples_tuple07_del ():
#------------------------------------------
def Tuples_tuple07_del ():
    """Tuples_tuple07_del"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Tuples_tuple07_del.__name__}')
    print (f'#-----------------------------')

    ## 07. Удаление кортежа
    # Удалять из кортежа элементы нельзя, но можно удалить его полностью с помощью ключевого слова del:

    my_tuple = (1, 2, 3, 4, 5)
    # Удаление кортежа
    del my_tuple

    # Попробуем распечатать удалённый кортеж
    print(my_tuple)
    # Ошибка: NameError: name 'my_tuple' is not defined
    # В этом примере del my_tuple удаляет ссылку на кортеж из памяти. После этого переменной my_tuple больше не существует и попытка обратиться к ней вызовет ошибку NameError.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Tuples_tuple07_del ()
#endif

#endmodule
