#------------------------------------------
# Tuples_tuple12_to_dict ():
# Превратить кортеж в словарь одной строкой? Легко!
# Допустим, у нас есть кортеж, где каждое значение – строка из двух символов:

#------------------------------------------
def Tuples_tuple12_to_dict ():
    """Tuples_tuple12_to_dict"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Tuples_tuple12_to_dict.__name__}')
    print (f'#-----------------------------')

    # Кортеж в словарь (пары «ключ — значение»):
    my_tuple = (('a', 1), ('b', 2), ('c', 3))
    # Преобразование кортежа в словарь
    my_dict = dict(my_tuple)
    print('Кортеж:', my_tuple)
    print('Словарь:', my_dict)
    # Результат:
    # Кортеж: (('a', 1), ('b', 2), ('c', 3))
    # Словарь: {'a': 1, 'b': 2, 'c': 3}

    # Как можно изменить элементы
    values = ('a1', 'b2', 'c3')
    # Если “навесить” функцию dict():
    print (dict (values))

    # то в результате мы получим словарь с разделёнными на «ключ –
    # значение» парами:
    # {'a': '1', 'b': '2', 'c': '3'}
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Tuples_tuple12_to_dict ()
#endif

#endmodule
