#------------------------------------------
# Tuples_tuple12_to_str ():
#------------------------------------------
def Tuples_tuple12_to_str ():
    """Tuples_tuple12_to_str"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Tuples_tuple12_to_str.__name__}')
    print (f'#-----------------------------')

    ## 12. Преобразование в другие типы данных
    # В Python можно преобразовывать кортежи в другие типы данных: списки, строки, множества или словари.

    # А так можно преобразовать кортеж в строку:
    my_tuple = (1, 2, 3)
    # Преобразование кортежа в строку
    my_string = ''.join(map(str, my_tuple))
    print('Кортеж:', my_tuple)
    print('Строка:', my_string)
    # Здесь использовали встроенную функцию str.join. Работает она просто — переводит каждый элемент кортежа в строковый тип, а затем объединяет их в одну строку.
    # Результат:
    # Кортеж: (1, 2, 3)
    # Строка: 123

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Tuples_tuple12_to_str ()
#endif

#endmodule
