#------------------------------------------
# Tuples_tuple09_min_max ():
#------------------------------------------
def Tuples_tuple09_min_max ():
    """Tuples_tuple09_min_max"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Tuples_tuple09_min_max.__name__}')
    print (f'#-----------------------------')

    ## 09. Функции кортежей Python
    # В Python есть встроенные функции, которые облегчают работу с кортежами.
    # min(tuple) Возвращает самый маленький элемент последовательности
    # max(tuple) Возвращает самый большой элемент последовательности
    # Минимальный и максимальный элементы кортежа можно получить с помощью функций min() и max():
    my_tuple = (1, 2, 3, 4, 5)
    min_element = min(my_tuple)
    max_element = max(my_tuple)
    print('Минимальный элемент кортежа:', min_element)
    print('Максимальный элемент кортежа:', max_element)
    # Результат выполнения:
    # Минимальный элемент кортежа: 1
    # Максимальный элемент кортежа: 5
    # Если кортеж пуст, то использование функций min() и max() вызовет ошибку ValueError.
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Tuples_tuple09_min_max ()
#endif

#endmodule
