#------------------------------------------
# tuples_tuple03_packing ():
#------------------------------------------
def tuples_tuple03_packing ():
    """Tuples_tuple03_Packing"""
#beginfunction
    print ('#-----------------------------')
    print (f'# {tuples_tuple03_packing.__name__}')
    print ('#-----------------------------')

    ## 03. Упаковка и распаковка
    # Упаковка (packing) и распаковка (unpacking) — это операции,
    # которые позволяют создавать кортеж из набора значений и извлекать
    # значения из кортежа в переменные. Рассмотрим их подробнее.

    # Упаковка кортежа. Значения 1, 2, 3 и 'hello' автоматически упаковываются в кортеж:
    my_tuple = 1, 2, 3, 'hello'
    # В переменной my_tuple теперь находится кортеж (1, 2, 3, 'hello')
    print (my_tuple)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    tuples_tuple03_packing ()
#endif

#endmodule
