#------------------------------------------
# Tuples_tuple12_to_list ():
#------------------------------------------
def Tuples_tuple12_to_list ():
    """Tuples_tuple12_to_list"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Tuples_tuple12_to_list.__name__}')
    print (f'#-----------------------------')

    ## 12. Преобразование в другие типы данных
    # В Python можно преобразовывать кортежи в другие типы данных: списки, строки, множества или словари.
    # Так можно превратить кортеж в список:
    my_tuple = (1, 2, 3, 4, 5)

    # Преобразование кортежа в список
    my_list = list(my_tuple)
    print('Кортеж:', my_tuple)
    print('Список:', my_list)
    # Результат:
    # Кортеж: (1, 2, 3, 4, 5)
    # Список: [1, 2, 3, 4, 5]

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Tuples_tuple12_to_list ()
#endif

#endmodule
