#------------------------------------------
# Tuples_tuple08_add ():
# Конкатенация кортежей
# Кортежи могут быть обьеденены с использованием оператора +
#------------------------------------------
def Tuples_tuple08_add ():
    """Tuples_tuple08_add"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Tuples_tuple08_add.__name__}')
    print (f'#-----------------------------')

    ## 08. Конкатенация и повторение
    # В Python для кортежей доступны операции конкатенации (сложения) и повторения (умножения). Эти операции могут использоваться при создании новых кортежей на основе существующих.

    ### Конкатенация
    # Это объединение двух кортежей в один новый кортеж с помощью оператора +.
    tuple1 = (1, 2, 3)
    tuple2 = (4, 5, 6)
    concatenated_tuple = tuple1 + tuple2
    print('Конкатенация кортежей:', concatenated_tuple)
    # Результат:
    # Конкатенация кортежей: (1, 2, 3, 4, 5, 6)
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Tuples_tuple08_add ()
#endif

#endmodule
