#------------------------------------------
# Tuples_tuple09_len ():
#------------------------------------------
def Tuples_tuple09_len ():
    """Tuples_tuple09_len"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Tuples_tuple09_len.__name__}')
    print (f'#-----------------------------')

    ## 09.Функции кортежей Python
    # В Python есть встроенные функции, которые облегчают работу с кортежами.
    # len(tuple) Длина кортежа

    # Длину кортежа можно получить функцией len(), которая возвращает количество элементов в кортеже:
    my_tuple = (1, 2, 3, 4, 5)
    length_of_tuple = len(my_tuple)
    print('Длина кортежа:', length_of_tuple)
    # Результат:
    # Длина кортежа: 5
#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Tuples_tuple09_len ()
#endif

#endmodule
