#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/1940980684/103
    # 🐍 Модуль calendar
    #
    # В Python есть встроенный модуль Calendar, содержащий
    # полезные классы и функции для поддержки различных операций с
    # календарем.
    #
    # По умолчанию Calendar следует григорианскому календарю, где
    # понедельник — это первый день (0) недели, а воскресенье —
    # последний (6).
    #
    # В Python модули datetime и time также предоставляют
    # низкоуровневые функции, связанные с календарем. В дополнение
    # к этим модулям, модуль Calendar предоставляет важные
    # функции, связанные с отображением и управлением календарями.
    #
    # import calendar
    #
    # year = 2023
    # month = 10;
    #
    # print(calendar.month(year, month) )
    #
    # October 2023
    #
    # Mo Tu We Th Fr Sa Su
    #
    # 1
    #
    # 23 46 7, 8
    #
    # 9 10 11 12 12°14. 15
    #
    # 16 17 18 19 20 21 22
    #
    # 23924) 25° 26527 28) 29
    # 30 31
    #
    # HoH HH He HH HK HF
    #
    # B Python ectb Mopynb Calendar, cogep»kalun Knaccbi u
    #
    # ®yHKuWNY ANA NoARepKKU pasnuuHbix OnepauMii c KaneHAapem.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
