#------------------------------------------
# Dicts_dict21_sort02 ():
#------------------------------------------
def Dicts_dict21_sort02():
    """Dicts_dict21_sort02"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Dicts_dict21_sort02.__name__}')
    print (f'#-----------------------------')

    # https://t.me/py_1000_prog/3906
    # 📣 Как отсортировать словарь Python по ключу
    #
    # Сортировка – это фундаментальная операция в
    # программировании, суть которой заключается в расположении
    # элементов в определенном порядке.
    #
    # В этой статье мы разберем, как отсортировать словарь по
    # ключам в Python. Для облегчения понимания мы рассмотрим
    # данную операцию пошагово
    #
    # 🖥 Читать подробнее (https://pythonist.ru/sortirovka-slovarej-python-po-klyuchu/)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Dicts_dict21_sort02 ()
#endif

#endmodule
