#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/516
    # 🔵Комбинируйте словарные значения
    #
    # Defaultdict — это подкласс класса словаря, который
    # возвращает объект, подобный словарю. Чем это отличается от
    # обычного словаря? Хотя словарь и словарь по умолчанию почти
    # идентичны, последний позволяет нам избежать KeyErrors.
    # Другими словами, он предоставляет значение по умолчанию для
    # несуществующего ключа. Эта характеристика defaultdictionary
    # упрощает следующие операции.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
