#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pytstart/113
    # 👩‍💻 Как работает __missing__ в dict?
    #
    # Можно создать словарь с кастомной логикой для отсутствующих
    # ключей!
    #
    # ➡️ Пример:
    #
    # class CustomDict(dict):
    #     def __missing__(self, key):
    #         return f"Ключ {key} отсутствует!"
    #
    # data = CustomDict(a=1, b=2)
    # print(data["a"])  # 1
    # print(data["c"])  # Ключ c отсутствует!
    #
    # ✔️ Полезно для динамических словарей, автозаполнения
    # значений и логирования

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
