#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/c/2383487131/545
    #
    # Дата: 2025-05-25 16:00:13+00:00
    #
    # Title: Ghostly Python
    #
    # 📱 **Фишка: **`operator.itemgetter`** — извлечение полей из
    # объектов и коллекций**
    #
    # Позволяет удобно и быстро получать элементы по индексам или
    # ключам, особенно полезно в сочетании с функциями сортировки
    # и группировки.
    #
    # ```from operator import itemgetter
    #
    # data = [("Алиса", 25), ("Боб", 30), ("Чарли", 20)]
    #
    # # Сортируем по возрасту (второй элемент кортежа)
    # sorted_data = sorted(data, key=itemgetter(1))
    # print(sorted_data)  # [('Чарли', 20), ('Алиса', 25), ('Боб',
    # 30)]```
    #
    # 📌 **Как это работает? **
    #
    # 🟢 `itemgetter(n)` возвращает функцию, извлекающую n-й
    # элемент.
    # 🟢 Удобно использовать с `sorted()`, `map()`, `groupby()` и
    # др.
    # 🟢 Работает с кортежами, списками, словарями и объектами

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
