#------------------------------------------
# Generators_07_ ():
#------------------------------------------
def Generators_07_ ():
    """Generators_07_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Generators_07_.__name__)
    print ('#-----------------------------')

    # https://t.me/pyth0n_er/724
    # 🐍Генераторные выражения и списковые включения.
    #
    # В примере выше первая и вторая строчки очень похожи, но
    # различаются видами скобок. В списковом включении они
    # квадратные, а в генераторном выражении – круглые.
    #
    # 🔵Если вывести переменные, то видим, что значением переменной
    # l является список, а переменная g хранит в себе объект
    # генератора. И здесь возникает вопрос, что же использовать.
    #
    # Нужен результат, например в виде списка, прямо сейчас для
    # дальнейшего выполнения программы — используйте генераторы
    # коллекций.
    #
    # А если же значения понадобятся еще не скоро или неизвестно,
    # понадобится ли они вообще, то предпочтительнее генераторы,
    # чтобы не занимать лишнюю память и не нагружать систему.
    #
    # [i for i in range(5)]
    # g = (i for i in range(5))
    #
    # print(l)
    #
    # #10, 1; 2; 3, 4]
    # print(g) .
    #
    # # <generator object <genexpr> at Ox7ff7180faf90>
    #
    # for i ing:
    # print(i , end )
    #
    # @ ewy.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Generators_07_ ()
#endif

#endmodule
