#------------------------------------------
# Generators_10_ ():
#------------------------------------------
def Generators_10_ ():
    """Generators_10_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Generators_10_.__name__)
    print ('#-----------------------------')

    # Link: https://t.me/Python_per_month/3432
    #
    # Дата: 2025-05-28 14:43:40+00:00
    #
    # Title: Python Learning
    #
    # ➡️** Использование генераторов для создания бесконечных
    # последовательностей в Python**
    #
    # Генераторы в Python позволяют создавать ленивые
    # последовательности, которые вычисляются по мере
    # необходимости.
    #
    # 🗣️ Это мощный инструмент для работы с большими или даже
    # бесконечными данными, поскольку генераторы экономят память и
    # ресурсы. Один из интересных и необычных способов
    # использования генераторов — создание бесконечных
    # последовательностей.
    #
    # def is_prime(n):
    # lf n <2
    # return False
    # | for i in range(2, int(n ** 0.5) + 1):
    # “Ze Uf Ws TSG?
    # return False
    # return True
    #
    # def infinite_primes():
    # num = 2
    # while True:
    #
    # if is_prime(num):
    # yield num
    #
    # num += 1
    #
    # # [Ipumep ucnosib30BaHuA
    # primes = infinite_primes()
    #
    # for _ in range(10):
    #
    # print(next(primes))° # BsisogurT nepsbie 10 npoctbix yucen

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Generators_10_()
#endif

#endmodule
