#------------------------------------------
# Functions_09_ ():
#------------------------------------------
def Functions_09_ ():
    """Functions_09_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Functions_09_.__name__)
    print ('#-----------------------------')

# https://t.me/py_1000_prog/3030
# 📣 Как в Python применяются вложенные функции
#
# В статье рассмотрим на примерах, в чем польза вложенных
# функций Python и как их применять для инкапсуляции кода,
# замыканий и декораторов.
#
# Вложенные (или внутренние, англ. inner, nested) функции –
# это функции, которые мы определяем внутри других функций.
#
# В Python такая функция имеет прямой доступ к переменным и
# именам, определенным во включающей её функции.
#
# Вложенные функции имеют множество применений, в первую очередь для создания замыканий и декораторов (https://proglib.io/p/vse-chto-nuzhno-znat-o-dekoratorah-python-2020-05-09). (https://proglib.io/p/vse-chto-nuzhno-znat-o-dekoratorah-python-2020-05-09)
#
# 🖥 Читать подробнее (https://proglib.io/p/kak-v-python-primenyayutsya-vlozhennye-funkcii-2021-02-09)

#endfunction


#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Functions_09_ ()
#endif

#endmodule
