#------------------------------------------
# Functions_17_ ():
#------------------------------------------
def Functions_17_ ():
    """Functions_17_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Functions_17_.__name__)
    print ('#-----------------------------')

# https://t.me/python_ready/383
# 🖥 Учимся возвращать значения из функции
#
# В этом посте мы рассмотрели три способа работы с несколькими
# возвращаемыми значениями. Также вы узнаете про:
#
# - Возвращение через кортеж
# - Возвращение через словарь
# - Создание именованного кортежа
# - Использование именованного кортежа


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Functions_17_ ()
#endif

#endmodule
