#------------------------------------------
# Functions_16_ ():
#------------------------------------------
def Functions_16_ ():
    """Functions_16_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Functions_16_.__name__)
    print ('#-----------------------------')

    # https://t.me/python_ready/487
    # 🖥 Хоть раз работали с функциями высшего порядка?
    #
    # В этом посте мы их и рассмотрим. Применение функций высшего
    # порядка помогает сделать код гибким, читаемым и легче
    # поддающимся изменениям.
    #
    # - Применение к списку
    # - Использование map()
    # - Функция высшего порядка с возвращаемым значением

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Functions_16_ ()
#endif

#endmodule
