#------------------------------------------
# Functions_11_ ():
#------------------------------------------
def Functions_11_ ():
    """Functions_11_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', Functions_11_.__name__)
    print ('#-----------------------------')

    # https://t.me/PythonTechCode/870
    # 🔥 Ключевые аспекты хорошего программирования: использование
    # встроенных функций
    #
    # map и другие функции высшего порядка часто реализованы на
    # низкоуровневых языках (например, на C), что делает их более
    # эффективными по сравнению с эквивалентным кодом, написанным
    # на Python.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Functions_11_ ()
#endif

#endmodule
