#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/osint_pythons/4277
    #
    # Дата: 2025-06-17 14:59:06+00:00
    #
    # Title: Python и 1000 уязвимостей
    #
    # ℹ️ **Как работают операторы break, continue и pass в Python?
    #
    # Циклы** – позволяют выполнять повторяющийся код, пока не
    # достигнуто нужное условие,
    # но иногда нам нужно прервать выполнение цикла досрочно,
    # пропустить итерацию или просто оставить блок пустым
    #
    # **Для этих целей в Python существуют специальные операторы
    # управления потоком:**
    #  ⏺ **break** – досрочно прерывает цикл
    #  ⏺ **continue** – пропускает текущую итерацию и переходит к
    # следующей
    #  ⏺ **pass** – ничего не делает, просто заглушка
    #
    # — В этой статье мы разберём, как, когда и зачем использовать
    # эти конструкции, все примеры охватывают реальные сценарии
    # использования
    #
    # 🖥 [Читать подробнее](https://pythonlib.ru/post20)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
