#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/978
    # 🐍Модуль itertools в Python предоставляет мощные инструменты
    # для работы с итерируемыми объектами, такими как списки,
    # кортежи, множества и др. Он содержит несколько функций,
    # которые позволяют создавать и комбинировать итераторы для
    # различных задач.
    #
    # ➡️Некоторые из наиболее полезных функций модуля itertools
    # включают в себя:
    #
    # 1. itertools.count(start=0, step=1) - создает бесконечную
    # последовательность чисел, начиная с start с шагом step.
    #
    # 2. itertools.cycle(iterable) - бесконечно повторяет элементы
    # из итерируемого объекта.
    #
    # 3. itertools.chain(*iterables) - объединяет несколько
    # итерируемых объектов в один.
    #
    # 4. itertools.permutations(iterable, r=None) - возвращает все
    # возможные перестановки элементов из итерируемого объекта.
    #
    # 5. itertools.combinations(iterable, r) - возвращает все
    # возможные комбинации без повторений длиной r из итерируемого
    # объекта.
    #
    # 6. itertools.product(*iterables, repeat=1) - возвращает
    # декартово произведение итерируемых объектов.
    #
    # ⬆️Это лишь небольшая часть возможностей модуля itertools.
    # Используя его функции, можно легко и эффективно решать
    # различные задачи, связанные с итерируемыми объектами в
    # Python.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
