#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/zen_of_python/3975
    # itertools | База
    #
    # Шикарная англоязычная статья (https://mathspp.com/blog/module-itertools-overview) для начинающих про встроенный модуль для итерирования почти всего. Там вы разберетесь:
    # — с популярными методами (product, chain, pairwise);
    # — итераторами, меняющими разрешение выходного объекта;
    # — фильтрующими и комбинирующими итераторами.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
