#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonTechCode/205
    # Извлечение данных по требованию
    #
    # islice в Python - это функция из модуля itertools, которая
    # позволяет создавать итераторы, возвращающие указанное
    # количество элементов из итерируемого объекта.
    #
    # Одним из ключевых преимуществ islice является возможность
    # извлекать элементы из исходного итерируемого объекта по мере
    # необходимости, что позволяет эффективно работать с большими
    # наборами данных без загрузки их полностью в память.
    #
    #
    # from itertools import islice
    # data = [1, 2, 3, 4-5, 6, 7, 8, 9]
    # sliced_data = islice(data, 3, 7)
    #
    # print(list(sliced_data) )
    # wodh4, 5, 6, 7]

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
