#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/PythonTechCode/219
    # Объединение разнородных данных
    #
    # Функция chain() из модуля itertools предназначена для объединения данных из различных списков, кортежей, строк или других итерируемых (https://t.me/PythonTechCode/97) объектов в один итератор.
    #
    # Это удобно для эффективного объединения данных из различных
    # источников и работы с ними, будто это один непрерывный
    # поток.
    #
    # Одной из ключевых особенностей itertools.chain() является
    # то, что она возвращает итератор, что позволяет сэкономить
    # память и работать с данными по требованию.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
