#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/2383487131/336
    # 📱 Фишка: itertools.cycle — бесконечный перебор элементов
    #
    # Позволяет зациклить последовательность и бесконечно
    # перебирать её элементы.
    #
    # from itertools import cycle
    #
    # colors = cycle(["🔴", "🟢", "🔵"])
    #
    # for _ in range(6):
    #     print(next(colors), end=" ")  # 🔴 🟢 🔵 🔴 🟢 🔵
    #
    # 📌 Как это работает?
    #
    # 🟢 cycle() создает бесконечный итератор из списка.
    # 🟢 Позволяет перебирать элементы без ручной обработки
    # индексов.
    # 🟢 Полезно для циклической смены состояний или анимаций.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
