#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/2496
    # Функция itertools.chain()
    #
    # Функция itertools.chain() в Python объединяет несколько
    # итераторов в один. Она принимает в качестве аргумента один
    # или несколько итераторов, и возвращает итератор, который
    # последовательно возвращает элементы из этих итераторов.
    #
    # Например, код сверху объединяет две строки в одну.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
