#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # ​ (http://api.channely.co/file/720fa091459147e9be644d51200a
    # c15d)Как проитерировать разномастный список «по атомам»
    #
    # Если у нас есть список, содержащий объекты разного типа —
    # строки, списки, словари, то превратить этот набор в перечень
    # «неделимых» элементов — букв и чисел, поможет модуль chain
    # библиотеки itertools:
    #
    # from itertools import chain
    #
    #  chained = chain('ab', [33])
    #  next(chained) # a
    #  next(chained) # b
    #  next(chained) # 33
    #
    # Какие еще фишки itertools вы знаете? Поделитесь в
    # комментариях.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
