#------------------------------------------
# finally_01_ ():
#------------------------------------------
def finally_01_ ():
    """finally_01_"""
#beginfunction
    print ('#-----------------------------')
    print ('#', finally_01_.__name__)
    print ('#-----------------------------')

    # Link: https://t.me/docs_python_ru/2781
    #
    # Дата: 2025-06-11 20:00:04+00:00
    #
    # Title: Docs-Python.ru
    #
    # 🔁⚡Изменение информации.
    #
    # 👉 **Инструкция finally, очистка внешних ресурсов в Python.**
    #
    # 📝 __В Python блок finally используется в конструкции
    # try...except...finally для выполнения кода, который должен
    # быть выполнен вне зависимости от того, произошло ли
    # исключение или нет. Он часто применяется для освобождения
    # ресурсов, таких как файлы, сетевые соединения и т.п.__
    #
    # 🌐 https://docs-python.ru/tutorial/oshibki-iskljuchenija-python/ispolzovanie-finally-konstruktsii-try/

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    finally_01_ ()
#endif

#endmodule
