#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')
h
    # ttps://t.me/Python_per_month/3407
    # ⚙️ pickle для быстрого и эффективного хранения
    #
    # ℹ️ Точно так же, как размеры наборов данных становятся всё
    # больше и больше, растут и наши потребности в их более
    # быстром и эффективном хранении. Одной из альтернатив плоским
    # CSV-файлам, которые поставляются с вашей установкой Python,
    # является формат файла pickle.
    #
    # 🗣️ На самом деле он примерно в 80 раз быстрее CSV при вводе-
    # выводе и занимает меньше памяти.
    #
    # 🔗 Ссылочка на доку (https://docs.python.org/3/library/pickle.html)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
