#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')
    # Link: https://t.me/Py_Script/1638
    #
    # Дата: 2025-06-25 19:03:06+00:00
    #
    # Title: Python_Scripts
    #
    # 🔥 **Полезные библиотеки Python**
    #
    # ✅ `dill `
    #
    # 📌 **dill** — расширение pickle, позволяющее сериализовать
    # почти всё в Python: lambda, локальные функции, замыкания,
    # генераторы и даже состояние интерпретатора.
    #
    # 📌 **Особенности библиотеки:**
    # 🟠Работает там, где pickle падает
    # 🟠Подходит для multiprocessing с функциями без глобального
    # контекста
    # 🟠Можно сохранить/восстановить сессию (dill.dump_session())
    #
    # ⚙️ **Установка**:
    # ```pip install dill```
    #
    # 🔢 [Документация](https://pypi.org/project/dill/)

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
