#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/Python_libr/2727
    #
    # Дата: 2025-06-19 05:32:40+00:00
    #
    # Title: Python | Программирование
    #
    # **📌 Модуль operator, интерфейс встроенных операторов Python.
    #
    # **• Модуль operator экспортирует набор эффективных функций,
    # которые соответствуют внутренним операторам Python.
    #
    # Например operator.add(x, y) эквивалентен выражению x + y.
    #
    # • Многие имена функций используются для специальных методов
    # без двойного подчеркивания. Для обратной совместимости
    # многие из них имеют вариант с сохранением двойного
    # подчеркивания. Варианты без двойного подчеркивания
    # предпочтительны для ясности.
    #
    # Фрагмент кода показывает, как можно написать простой
    # калькулятор при помощи модуля operator (код на картинке).
    #
    # [📕 Документация
    #
    # ](https://docs-python.ru/standart-library/modul-operator-python/)#урок


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
