#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # ​ (http://api.channely.co/file/c401a8a2e05740d99022c8ada334291a)
    # Deque: следующий шаг питониста при обращении со списками
    #
    # deque (double-ended queue – «двусторонняя очередь») - это
    # структура данных в Python, представляющая собой двустороннюю
    # очередь. Она позволяет эффективно добавлять и удалять
    # элементы как с начала, так и с конца очереди. Реализована в
    # модуле collections.
    #
    # my_deque.append(4) # в конец очереди
    # my_deque.appendleft(0) # в начало очереди
    #
    # Вот другие операции, которые можно выполнять с двусторонней
    # очередью:
    #
    # — вставка элементов на определенную позицию (insert());
    # — удаление первого вхождения элемента (remove());
    # — проверка наличия элемента (in);
    # — переворот элементов (reverse());
    # — получение срезов (slice);
    # — сортировка (sort()).
    #
    # deque исполняет все за константное время и потому является
    # эффективным выбором для работы с большими объёмами данных.


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
