#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/413
    # Подсчет количества элементов
    #
    # Этот лайфхак полезен для подсчета всех появляющихся
    # элементов с помощью встроенной библиотеки Python. Вместо
    # использования циклических и условных операторов и прочей
    # логики, просто следуйте логике этого кода.
    #
    # # VUmnoptupyute mopynb
    #
    # from collections import Counter
    #
    # Ust= [1, 25,1, 3, 4, 1, 4,3, 5: 9.9, 10]
    # occurrences = Counter(lst)
    # print(occurrences) # Counter({1: 3, 3: 2, 4:
    # 2, 92 2; 29 2, 5: Ty LOn 2)


#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
