#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/pyth0n_er/925
    # ✅Counter - это класс из модуля collections в Python, который
    # используется для подсчета хэшируемых объектов. Он
    # представляет собой специальный вид словаря, который
    # позволяет подсчитывать количество вхождений каждого
    # уникального элемента в последовательности (списке, кортеже,
    # строки и т. д.).
    #
    # 🔫Код на фото создаст объект Counter, который подсчитает
    # количество вхождений каждого элемента в списке my_list.
    # Результат будет представлен в виде словаря, где ключами
    # будут уникальные элементы, а значениями - их количество.
    #
    # 💡Счетчик counter позволяет легко вычислить частоту. Он
    # работает не только с числами, но и с любым итерируемыми
    # объектами, такими как строки и списки.
    #
    # O00
    #
    # from collections import Counter
    #
    # My. list = [1525/35 1) 2, 0, 4,15, 3)
    # my_counter = Counter(my_list)
    # print(my_counter)
    #
    # Counter

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
