# ------------------------------------------
# f_strings_f_strings08_escape ():
# ------------------------------------------
def f_strings_f_strings08_escape ():
    """f_strings_f_strings08_escape"""
#beginfunction
    print ('#-----------------------------')
    print ('#', f_strings_f_strings08_escape.__name__)
    print ('#-----------------------------')

    #------------------------------------------
    # Special characters: Can include quotes and special chars
    #------------------------------------------
    # print(f'He said {\"Hello\"}')  # Output: He said "Hello"
    print (f'He said \"{"Hello"}\"')

    #------------------------------------------
    # escape-символы и f-строки
    # f-строки не поддерживают escape-символы внутри фигурных скобок, а значит, мы не можем включить в них обратный слэш (\) для экранирования других символов. Вместо использования escape-символа мы, например, можем использовать другой тип кавычек. При этом обратный слэш разрешается в текстовой части строки.
    #------------------------------------------
    print (f'Текст в {'одинарных кавычках'}.')

    #------------------------------------------
    # SyntaxError: f-string: expecting '}'
    #------------------------------------------
    # print (f'Текст в {\'одинарных кавычках\'}.')    # SyntaxError: f-string expression part cannot include a backslash
    print(f'Текст в {"двойных кавычках"}.')    # Текст в двойных кавычках.

    #------------------------------------------
    # В самом тексте обратный слэш использовать можно, вот так: \', ура!
    # print (f'В самом тексте обратный слэш использовать можно, вот так: \', ', {"ура!"}. ')
    #------------------------------------------

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    f_strings_f_strings08_escape ()
#endif

#endmodule
