#------------------------------------------
# Lists_list01_Expand ():
#------------------------------------------
def Lists_list01_Expand ():
    """Lists_list01_Expand"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Lists_list01_Expand.__name__}')
    print (f'#-----------------------------')

    # https://t.me/c/1849804501/1020
    # Полезный сниппет на Python:
    #
    # Как за пару строк превратить список в словарь:
    #
    # keys = ['a', 'b', 'c']
    # values = [1, 2, 3]
    #
    # result = dict(zip(keys, values))
    # print(result)  # {'a': 1, 'b': 2, 'c': 3}﻿
    #
    # Почему это удобно:
    # zip() объединяет элементы из двух списков, а dict() сразу
    # превращает их в словарь. Идеально, когда нужно быстро
    # сопоставить ключи со значениями.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Lists_list01_Expand ()
#endif

#endmodule
