#------------------------------------------
# Lists_list01_Expand ():
#------------------------------------------
def Lists_list01_Expand ():
    """Lists_list01_Expand"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {Lists_list01_Expand.__name__}')
    print (f'#-----------------------------')

    # Link: https://t.me/c/2208774687/809
    #
    # Дата: 2025-06-01 09:20:10+00:00
    #
    # Title: Easy Python | Программирование
    #
    # 📝 **Списки в Python и работа с ними**
    #
    # Python имеет несколько видов встроенных структур для
    # **хранения и обработки данных,** один из которых — **список.
    # **
    #
    # **В **[**этой статье**](https://thecode.media/python-lists/)** разберём:**
    # 🟡Свойства и функции списков;
    # 🟡Какие над ними можно совершать операции;
    # 🟡Какие у них методы и многое другое.
    #
    # ⛓ **Ссылка: **[**Клик!**](https://thecode.media/python-lists/)**

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    Lists_list01_Expand ()
#endif

#endmodule
