#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3263
    # ⚙️ sys.call_tracing()
    #
    # sys.call_tracing() позволяет выполнить функцию с заданными
    # аргументами, включая трассировку вызовов, установленную
    # через sys.settrace(). Это полезно для профилирования и
    # отладки.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
