#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3255
    # ⚙️ sys.setprofile()
    #
    # Метод sys.setprofile() позволяет установить функцию
    # профилирования, которая вызывается при каждом вызове,
    # возврате или исключении в Python-коде. Это полезно для
    # отладки, анализа производительности и трассировки выполнения
    # кода.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
