#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/python_piton_javascript/2666
    # isatty()
    #
    # isatty() используется для проверки, подключен ли объект
    # файла к интерактивному терминалу. Интерактивный терминал —
    # это терминал, который позволяет пользователю вводить команды
    # и получать непосредственный отклик. Это часто включает в
    # себя консольное окно или оболочку.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
