#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/seniorpy/2750
    # ⚙️ Использование модуля sys.settrace для отладки и
    # профилирования
    #
    # В Python есть малоизвестная, но мощная функция —
    # sys.settrace(), которая позволяет установить собственный
    # обработчик трассировки для отладки и профилирования кода.
    #
    # ➡️ С её помощью можно отслеживать выполнение каждого вызова
    # функции, строки или даже изменения локальных переменных в
    # программе.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
