#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/3247
    # ⚙️ sys.addaudithook()
    #
    # Метод sys.addaudithook() позволяет отслеживать определённые
    # события в Python, такие как импорт модулей, вызовы системных
    # функций и доступ к ресурсам. Это полезно для мониторинга
    # безопасности и отладки.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
