#------------------------------------------
# _01_ ():
#------------------------------------------
def _01_ ():
    """_01_"""
#beginfunction
    print (f'#-----------------------------')
    print (f'# {_01_.__name__}')
    print (f'#-----------------------------')

    # https://t.me/Python_per_month/2866
    # ➡️ Проверка необходимой версии Python
    #
    # ✔️ Чтобы ваши пользователи не могли запустить скрипт в
    # несовместимой версии, в коде стоит проверить наличие
    # актуальной версии Python. Проведите простую проверку.

#endfunction

#------------------------------------------
#
#------------------------------------------
#beginmodule
if __name__ == "__main__":
    _01_ ()
#endif

#endmodule
